[
  {
    "name": "Investigator",
    "alignment": "Town",
    "alignmentType": "Investigative",
    "attack": "None",
    "defense": "None",
    "abilities": "Investigate someone each Night to receive a list of their possible roles.",
    "attributes": "A Framer, Disguiser, Arsonist or Hex Master can throw off your results.\n\nYou can find possible Investigative results of a role in each role's Additional Information.",
    "goal": "Lynch every criminal and evildoer.",
    "classicResults": "Investigator, Consigliere, Mayor",
    "covenResults": "Investigator, Consigliere, Mayor, Tracker, Plaguebearer",
    "additional": "Manipulated results are in the priority of Frames/Hexes > Douses > Disguises.\n\nImportant: Aliens and Community roles are not official so please check Community roles themselves for modified results.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Lookout",
    "alignment": "Town",
    "alignmentType": "Investigative",
    "attack": "None",
    "defense": "None",
    "abilities": "Watch someone at Night to see who visits them. You will learn their house numbers.",
    "attributes": "If 4 or more people visit, you will only know 3 of the visitors at random. You will know if there are more than 3 visitors.\n\nLookout is a visiting role; they will visit their target to use their ability.",
    "goal": "Lynch every criminal and evildoer.",
    "classicResults": "Lookout, Forger, Witch",
    "covenResults": "Lookout, Forger, Juggernaut, Coven Leader",
    "additional": "Disguises can fool Lookouts. Check Disguiser's additional information to learn more.\n\nIn the rare event that the Lookout's target was Seanced by a dead Medium, the Lookout will spot the dead Medium visiting the target.\n\nAlso in the rare event that the Lookout's target was visited by a Retributionist or Necromancer's raised target, the Lookout will see the house of the dead player visiting. Example: Retributionist in House 1 uses the dead Vigilante in House 2 to visit House 3, the Lookout will see 2 visit 3.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Sheriff",
    "alignment": "Town",
    "alignmentType": "Investigative",
    "attack": "None",
    "defense": "None",
    "abilities": "Check one person each Night for supsicious activity. Check additional information for a list of who appears Suspicious.",
    "attributes": "A Framer, Disguiser, Arsonist or Hex Master can throw off your results.",
    "goal": "Lynch every criminal and evildoer.",
    "classicResults": "Sheriff, Executioner, Werewolf",
    "covenResults": "Sheriff, Executioner, Werewolf, Poisoner",
    "additional": "Not Suspicious:\nAll Townies\nGodfather\nAll Neutrals except Serial Killer\nWerewolf during Non-Full Moon\nCoven members with the Necronomicon\n\nSuspicious:\nAll Mafia except Godfather\nSerial Killer\nWerewolf on Full Moon\nAll Coven without the Necronomicon\nAnyone Framed or Hexed\n\nImportant: Community roles may have their own exceptions. Aliens always appear Suspicious. For individual Community roles check additional information to see where exceptions apply.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Spy",
    "alignment": "Town",
    "alignmentType": "Investigative",
    "attack": "None",
    "defense": "None",
    "abilities": "Choose a player each Night to place a bug at their house. You will learn of all messages they get about actions taken against them that Night. Such as; \"you were roleblocked\", \"you were transported\", \"you were attacked but healed\", \"you were controlled but you were immune\", etc.",
    "attributes": "Get a list of all targets visited by all members of the Mafia and Coven each Night, along with how many visited each target.",
    "goal": "Lynch every criminal and evildoer.",
    "classicResults": "Spy, Blackmailer, Jailor",
    "covenResults": "Spy, Blackmailer, Jailor, Guardian Angel",
    "additional": "Your ability to see Mafia/Coven visits are unaffected by Transporters and will always display who the Mafia or Coven actually visit that Night. You will also be able to see Astral visits from the Coven (Hex Master with Necronomicon); but if a Disguiser Disguises a Mafia member as a Town, you will not see their visits.\n\nIn the Town Traitor game mode, you cannot see who the Town Traitor visits.\n\nIf you are roleblocked or jailed, you will not receive the results of your bug or the visits. If you are controlled, you will bug the controller's target, and the controller will get the Mafia and/or Coven visits along with feedback from the bug.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Jailor",
    "alignment": "Town",
    "alignmentType": "Killing",
    "attack": "Unstoppable",
    "defense": "None",
    "abilities": "Choose someone each day to jail for the Night and speak with them. The Jailor can ask the target 3 questions anonymously. Check Additional Information for the full Jailor process.\n\nNote: The Host has full discretion as to what is and is not permitted to ask as a question.",
    "attributes": "You have 3 executions. You cannot execute on the first Night. If you execute a Town or you run out of executions, you will not be able to execute anymore.\n\nJailing a target will grant them Powerful Defence. Anyone who targets the Jailed player will learn that their target is in jail and their ability will fail. If the Jailed player is attacked they will learn they were attacked.",
    "goal": "Lynch every criminal and evildoer.",
    "classicResults": "Spy, Blackmailer, Jailor",
    "covenResults": "Spy, Blackmailer, Jailor, Guardian Angel",
    "additional": "Jailing a platyer is considered a Day Ability, and cannot be prevented or blocked. However, if the Jailor is roleblocked, then they are prevented from executing their Jailed target.\n\nWhen controlled to visit your Jailed target you are forced to executed, if controlled to visit any other target you are prevented from executing.\n\nInformation you learn from your Jailed target can be used in your Last Will.\n\nJailor process:\nThe Jailor's target will be Jailed. Their ability will be completely blocked regardless of immunity. If they are a faction member, they can listen to the meeting but they cannot speak.\n\nAfter meetings, the host will ask the Jailor for up to 3 questions. The host will tell the Jailee the questions who will respond and relay the answers back to the Jailor. After receiving the answers, if the Jailor is able, they can choose to execute the target. Follow-up questions are not allowed.",
    "dlc": false,
    "unique": true
  },
  {
    "name": "Vampire Hunter",
    "alignment": "Town",
    "alignmentType": "Killing",
    "attack": "Basic",
    "defense": "None",
    "abilities": "Check someone each Night to see if they are a Vampire. If the target is a Vampire, you will stake them.",
    "attributes": "If you are visited by a Vampire, you will not be converted and you will also stake them simultaneously.\u000b\nYou will become a Vigilante with only one bullet when all Vampires are dead. You will stay as a Vigilante even if an Amnesiac remembers to be a Vampire.",
    "goal": "Lynch every criminal and evildoer.",
    "classicResults": "Survivor, Vampire Hunter, Amnesiac",
    "covenResults": "Survivor, Vampire Hunter, Amnesiac, Medusa, Psychic",
    "additional": "Unlike the video game, the Vampire Hunter will not be able to listen into Vampire meetings.\n\nIf your target is converted the same Night you check them, you will not prevent the conversion nor will you stake them.\n\nIf a Vampire Hunter is roleblocked, they will still stake any Vampires visiting them.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Veteran",
    "alignment": "Town",
    "alignmentType": "Killing",
    "attack": "Powerful",
    "defense": "None",
    "abilities": "Choose to go on alert each Night. You have three alerts.",
    "attributes": "While on alert, you gain Basic Defence and will deal a Powerful Attack to all visitors.",
    "goal": "Lynch every criminal and evildoer.",
    "classicResults": "Vigilante, Veteran, Mafioso, Ambusher",
    "covenResults": "Vigilante, Veteran, Mafioso, Pirate, Ambusher",
    "additional": "Veteran has Roleblock and Control Immunity.",
    "dlc": false,
    "unique": true
  },
  {
    "name": "Vigilante",
    "alignment": "Town",
    "alignmentType": "Killing",
    "attack": "Basic",
    "defense": "None",
    "abilities": "Choose to take justice in your own hands and shoot someone. You cannot shoot a player on the first Night.",
    "attributes": "You only have 3 bullets. If you shoot a Town, you will put your gun away and commit suicide over the guilt at the end of the next Night. Suicide cannot be prevented in any way.",
    "goal": "Lynch every criminal and evildoer.",
    "classicResults": "Vigilante, Veteran, Mafioso, Ambusher",
    "covenResults": "Vigilante, Veteran, Mafioso, Pirate, Ambusher",
    "additional": "If the Vigilante is controlled, they will be forced to shoot, even if it's the first Night. If the Vigilante has already shot a Town and is going to commit suicide, they cannot shoot again even if controlled that Night.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Bodyguard",
    "alignment": "Town",
    "alignmentType": "Protective",
    "attack": "Powerful",
    "defense": "None",
    "abilities": "Choose someone to protect at Night. You will protect your target from one attack, forcing the attacker to attack you instead. You will deal a Powerful Attack to the attacker.\n\nOnce per game, you can choose to put on a vest to protect yourself, granting yourself Basic Defence for one Night.",
    "attributes": "If you successfully protect your target from an attack, you and your target will learn they were attacked but protected.\n\nYou can only defend your target against one attack. If your target is attacked by multiple attackers at once, you will protect against one of them at random.",
    "goal": "Lynch every criminal and evildoer.",
    "classicResults": "Bodyguard, Godfather, Arsonist",
    "covenResults": "Bodyguard, Godfather, Arsonist, Crusader",
    "additional": "Bodyguards protecting themselves will not counter-attack any attacking roles that visit them that Night.\n\nThe bodyguard will also protect their target against the Vigilante. The Bodyguard will be shot and the Vigilante will die to the Bodyguard.\n\nBodyguard can attack the Vampire Hunter if the Bodyguard was protecting a Vampire, since the Vampire Hunter will attack the Vampire.\n\nBodyguard does not protect against astral or indirect attacks, such as; Ambusher ambushes, Veteran alerts, other Bodyguard counter-attacks, or Hex Master attacks.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Doctor",
    "alignment": "Town",
    "alignmentType": "Protective",
    "attack": "None",
    "defense": "None",
    "abilities": "Heal one person each Night. You will grant them Powerful Defence.\n\nOnce per game, you can instead choose to protect yourself, granting yourself Powerful Defence for one Night.",
    "attributes": "If you successfully heal your target from an attack, you and your target will learn they were attacked but healed.",
    "goal": "Lynch every criminal and evildoer.",
    "classicResults": "Doctor, Disguiser, Serial Killer",
    "covenResults": "Doctor, Disguiser, Serial Killer, Potion Master",
    "additional": "The Doctor cannot heal a revealed Mayor.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Escort",
    "alignment": "Town",
    "alignmentType": "Support",
    "attack": "None",
    "defense": "None",
    "abilities": "Choose someone to distract each Night, preventing them from using their ability (if they are not Roleblock Immune).",
    "attributes": "Target learns they were Roleblocked.\n\nRoleblocking a Serial Killer that isn't Cautious cause them to kill you along with their intended target. Roleblocking a Werewolf on a Full Moon will force them to stay at home, attacking all visitors including you.",
    "goal": "Lynch every criminal and evildoer.",
    "classicResults": "Escort, Transporter, Consort, Hypnotist",
    "covenResults": "Escort, Transporter, Consort, Hypnotist",
    "additional": "Escort has Roleblock Immunity.\n\nYou do not learn if your target was Roleblock Immune.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Mayor",
    "alignment": "Town",
    "alignmentType": "Support",
    "attack": "None",
    "defense": "None",
    "abilities": "Choose to reveal yourself as the Mayor of the Town at day by saying 'I reveal as Mayor'. You must say this exact phrase.\n\nYou can still reveal even if you are Blackmailed by a Blackmailer.",
    "attributes": "Once revealed, your vote counts as three, but you can no longer be healed by a Doctor and you are no longer allowed to have whispers.",
    "goal": "Lynch every criminal and evildoer.",
    "classicResults": "Investigator, Consigliere, Mayor",
    "covenResults": "Investigator, Consigliere, Mayor, Tracker, Plaguebearer",
    "additional": "Mayor has no Roleblock Immunity, but their ability cannot be blocked as it's a Day Ability.\n\nBe careful. In the rare event you get converted to a Vampire as a Revealed Mayor, you will no longer appear as a Mayor, lose your votes and people will be able to whisper you. This will give away you are no longer a Mayor.",
    "dlc": false,
    "unique": true
  },
  {
    "name": "Medium",
    "alignment": "Town",
    "alignmentType": "Support",
    "attack": "None",
    "defense": "None",
    "abilities": "You can speak with the dead at Night. The host has to summon you out of your house and send you to the graveyard to talk with the dead.\n\nYour ability works even if you are jailed.",
    "attributes": "Once per game, while you are dead, you can seance a living player to speak with them privately at Night.",
    "goal": "Lynch every criminal and evildoer.",
    "classicResults": "Medium, Janitor, Retributionist",
    "covenResults": "Medium, Janitor, Retributionist, Necromancer, Trapper",
    "additional": "Medium has no Roleblock Immunity, but their ability cannot be blocked as it is a passive Night ability.\n\nThe host can handle the Medium's ability in different ways depending on preference. They can either summon you before starting the faction meetings or after the faction meetings have ended, you can talk with the dead in the graveyard until morning. Be sure to not leave the graveyard where you might be seen or see what you shouldn't, instead respawn and teleport to your house.\n\nInformation you learn from the dead can be used in your last will, and information you tell players during a Seance can be used in their last will.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Retributionist",
    "alignment": "Town",
    "alignmentType": "Support",
    "attack": "None",
    "defense": "None",
    "abilities": "At night, raise a dead player as a zombie and have them use their ability on your behalf. Each dead player can only be used once. Only revealed Town roles can be used, with a few exceptions.",
    "attributes": "The Retributionist only use Town roles, only those that are not Cleaned or Stoned, and cannot use the Psychic, Jailor, Veteran, Trapper, Mayor, Medium or Transporter.\n\nDead players can only be used once. If the target has been reanimated by a Necromancer, they learn their ability has failed and the target will no longer be eligible for resurrection. If the Retributionist and Necromancer target the same player, the Necromancer has priority.",
    "goal": "Lynch every criminal and evildoer.",
    "classicResults": "Medium, Janitor, Retributionist",
    "covenResults": "Medium, Janitor, Retributionist, Necromancer, Trapper",
    "additional": "Retributionist has Roleblock and Control Immunity.\n\nImportant: Community roles may have their own restrictions. Check the additional information for individual Community roles to see where restrictions apply.\n\nIf the rare circumstance that an Amnesiac uses a Retributionist, they cannot use any targets used by the previous Retributionist.\n\nA Tracker will see you visit the house of the dead player you want to use. And a Lookout will see the dead player you used visit your second target.",
    "dlc": false,
    "unique": true
  },
  {
    "name": "Transporter",
    "alignment": "Town",
    "alignmentType": "Support",
    "attack": "None",
    "defense": "None",
    "abilities": "Choose two people to switch places with each other for the Night. This will swap all targeted actions against them at Night (check additional information for examples).",
    "attributes": "You visit both targets.\n\nTargets will learn they have been transported, but not with who. You can choose to transport yourself with your second target.\n\nIf a target is Jailed, the transport will fail and you will learn that one of your targets was jailed.",
    "goal": "Lynch every criminal and evildoer.",
    "classicResults": "Escort, Transporter, Consort, Hypnotist",
    "covenResults": "Escort, Transporter, Consort, Hypnotist",
    "additional": "The Transporter has Roleblock and Control Immunity.\n\nYou cannot swap with an empty house, only alive players.\n\nThe Transporter will change all targeted actions agaisnt two players. Example:\nThe Investigator is going to investigate House 1. The Transporter swaps House 1 and 2. The Investigator will instead investigate House 2, but they will be unaware of this.\n\nIf multiple Transporters target the same houses, a random Transporter takes priority over which house performs the first swap. Process the second swap with the swapped houses.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Psychic",
    "alignment": "Town",
    "alignmentType": "Investigative",
    "attack": "None",
    "defense": "None",
    "abilities": "Receive three house numbers every odd Night, at least one of which will be evil.\nReceive two house numbers every even Night, at least one of which will be good.",
    "attributes": "Check additional information to see what roles count as good or evil roles.",
    "goal": "Lynch every criminal and evildoer.",
    "classicResults": "N/A",
    "covenResults": "Survivor, Vampire Hunter, Amnesiac, Medusa, Psychic",
    "additional": "Good: All Town and Neutral Benign.\nEvil: Mafia, Coven, Neutral Killing, Neutral Chaos and Neutral Evil.\n\nCommunity roles with custom alignments may appear differently, check individual roles for more information.\n\nIf you are Jailed or Roleblocked, you will not receive any information that night.\n\nIf there are less than 3 players on an odd night, or no other good players on an even night, the Psychic will simply learn they could not get a vision that night.\n\nThe house numbers given to the Psychic are always one confirmed good or evil and the others are totally random. This means that on an odd night you could get house numbers of one evil and two good, two evil and one good, or even three evils. The Psychic will never get their own hosue number.",
    "dlc": true,
    "unique": false
  },
  {
    "name": "Tracker",
    "alignment": "Town",
    "alignmentType": "Investigative",
    "attack": "None",
    "defense": "None",
    "abilities": "Track someone at Night to see who they visit.\n\nIf the target does not visit anyone, their ability is Astral or uses an ability on themselves, you are simply told they visited no one.",
    "attributes": "",
    "goal": "Lynch every criminal and evildoer.",
    "classicResults": "N/A",
    "covenResults": "Investigator, Consigliere, Mayor, Tracker, Plaguebearer",
    "additional": "Using your ability on an Retributionist or Necromancer will show them visiting a dead player's house if they did anything that night.\n\nIf you track a Jailor, you will get no results. Jailors do not leave their house, even if they choose to jail someone.",
    "dlc": true,
    "unique": false
  },
  {
    "name": "Crusader",
    "alignment": "Town",
    "alignmentType": "Protective",
    "attack": "Basic",
    "defense": "None",
    "abilities": "Guard someone each Night, granting them Powerful Defence.",
    "attributes": "Careful, you will deal a Basic attack to one visitor at random, regardless of their role. Vampires cannot be attacked, but you will block their conversion.",
    "goal": "Lynch every criminal and evildoer.",
    "classicResults": "N/A",
    "covenResults": "Bodyguard, Godfather, Arsonist, Crusader",
    "additional": "",
    "dlc": true,
    "unique": false
  },
  {
    "name": "Trapper",
    "alignment": "Town",
    "alignmentType": "Protective",
    "attack": "Powerful",
    "defense": "None",
    "abilities": "If you have an available trap, choose a player to place a trap at their house.\n\nIf you have no available trap, you will build a trap. Traps take one Night to build; they are built automatically at the end of the Night.\n\nIf you have a trap placed, you can choose to remove it. The trap will not need to be rebuilt and will be ready for placement the next Night. If a trap is triggered instead, it will need to be rebuilt.",
    "attributes": "The Trap will trigger when the trapped house is visited, it will reveal the roles (not names) of all visitors to you. If the trapped house was attacked, the Trap will also protect the house owner with Powerful Defence from one attack and deal a Powerful Attack to the associated attacker.",
    "goal": "Lynch every criminal and evildoer.",
    "classicResults": "N/A",
    "covenResults": "Medium, Janitor, Retributionist, Necromancer, Trapper",
    "additional": "If the Trapper is controlled on a night where they have an available trap, they will place it at the house they were controlled to and not know where it is. If the trap is triggered on a night the Trapper is controlled, the controller will get the information from it.\n\nIf the Trapper dies, the trap remains at the house's target until triggered. If the Trapper is converted to a Vampire, the trap is removed.\n\nTrapper starts the game with no available trap.",
    "dlc": true,
    "unique": false
  },
  {
    "name": "Godfather",
    "alignment": "Mafia",
    "alignmentType": "Killing",
    "attack": "Basic",
    "defense": "Basic",
    "abilities": "Choose who to attack at Night. If a Mafioso is alive, they will attack the target for you. If the Mafioso is Roleblocked or Jailed, or there is no Mafioso, you will carry out the attack yourself.",
    "attributes": "You have Basic Defence and will appear innocent to a Sheriff.",
    "goal": "Kill anyone that will not submit to the Mafia.",
    "classicResults": "Bodyguard, Godfather, Arsonist",
    "covenResults": "Bodyguard, Godfather, Arsonist, Crusader",
    "additional": "",
    "dlc": false,
    "unique": true
  },
  {
    "name": "Mafioso",
    "alignment": "Mafia",
    "alignmentType": "Killing",
    "attack": "Basic",
    "defense": "None",
    "abilities": "Choose a target to attack at Night. If there is a Godfather, anyone they pick overrides your decision. If the Godfather is Roleblocked or Jailed, you will attack your own target instead.",
    "attributes": "If you start the game as Mafioso and there is a Godfather, you become Godfather when they are killed.",
    "goal": "Kill anyone that will not submit to the Mafia.",
    "classicResults": "Vigilante, Veteran, Mafioso, Ambusher",
    "covenResults": "Vigilante, Veteran, Mafioso, Pirate, Ambusher",
    "additional": "If a Mafioso is controlled by a Witch but there is a Godfather ordering the Mafioso to kill their target, the Mafioso will still attack the Godfather's target.\n\nIn the extremely rare event that an Amnesiac remembers themselves as the Godfather and dies, a Promoted Mafioso can be promoted to Godfather.",
    "dlc": false,
    "unique": true
  },
  {
    "name": "Ambusher",
    "alignment": "Mafia",
    "alignmentType": "Killing",
    "attack": "Basic",
    "defense": "None",
    "abilities": "Choose one person to lie in wait outside their house each Night, attacking one random non-Mafia visitor.",
    "attributes": "You will deal a Basic Attack to one random non-Mafia visitor. If you ambush a visitor, all visitors will learn they saw your house number lying in ambush at the target.",
    "goal": "Kill anyone that will not submit to the Mafia.",
    "classicResults": "Vigilante, Veteran, Mafioso, Ambusher",
    "covenResults": "Vigilante, Veteran, Mafioso, Pirate, Ambusher",
    "additional": "Your attacks are considered Indirect, meaning they don't trigger Trap or Bodyguard counterattacks, and don’t show up to the Spy.\n\nIf there is no Godfather or Mafioso, you are eligible for promotion to Mafioso.",
    "dlc": false,
    "unique": true
  },
  {
    "name": "Blackmailer",
    "alignment": "Mafia",
    "alignmentType": "Support",
    "attack": "None",
    "defense": "None",
    "abilities": "Choose one person each Night to blackmail. Blackmailed players are not allowed to speak or whisper the following day.",
    "attributes": "If the Blackmailed player speaks, enters a whisper or performs gestures to communicate, they will be immediately killed on the spot (Blackmail is meant to be forced). On trial, Blackmailed players can only say 'I am blackmailed.' once and nothing else. Last words are unaffected by Blackmail.",
    "goal": "Kill anyone that will not submit to the Mafia.",
    "classicResults": "Spy, Blackmailer, Jailor",
    "covenResults": "Spy, Blackmailer, Jailor, Guardian Angel",
    "additional": "Unlike the Blackmailer in the original game, you are not allowed to hear whispers. This is due to game limitations in VRChat that makes it impossible for you to eavesdrop on whispers.\n\nAn unrevealed Mayor who has been Blackmailed can still reveal themselves as Mayor during the day.\n\nIf there is no Godfather or Mafioso, you are eligible for promotion to Mafioso.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Consigliere",
    "alignment": "Mafia",
    "alignmentType": "Support",
    "attack": "None",
    "defense": "None",
    "abilities": "Investigate someone each Night to learn their exact role.",
    "attributes": "Anyone that was Doused or Hexed will come up as the Arsonist or Hex Master respectively. You will not be fooled by Frames or your Disguiser's disguises.\n\nA Consigliere investigating a Framed player will not remove that player's Frame.",
    "goal": "Kill anyone that will not submit to the Mafia.",
    "classicResults": "Investigator, Consigliere, Mayor",
    "covenResults": "Investigator, Consigliere, Mayor, Tracker, Plaguebearer",
    "additional": "If there is no Godfather or Mafioso, you are eligible for promotion to Mafioso.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Consort",
    "alignment": "Mafia",
    "alignmentType": "Support",
    "attack": "None",
    "defense": "None",
    "abilities": "Choose someone to distract each Night, preventing them from using their ability (if they are not Roleblock Immune).",
    "attributes": "Target learns they were Roleblocked.\n\nRoleblocking a Serial Killer that isn't Cautious cause them to kill you along with their intended target. Roleblocking a Werewolf on a Full Moon will force them to stay at home, attacking all visitors including you.",
    "goal": "Kill anyone that will not submit to the Mafia.",
    "classicResults": "Escort, Transporter, Consort, Hypnotist",
    "covenResults": "Escort, Transporter, Consort, Hypnotist",
    "additional": "Consort has Roleblock Immunity.\n\nYou do not learn if your target was Roleblock Immune.\n\nIf there is no Godfather or Mafioso, you are eligible for promotion to Mafioso.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Disguiser",
    "alignment": "Mafia",
    "alignmentType": "Deception",
    "attack": "None",
    "defense": "None",
    "abilities": "Choose to either disguise yourself as the role of another target, or disguise one of your Mafia members as another target. You or your disguised teammates do not learn what the target role is.",
    "attributes": "Any investigative roles checking the disguised player will see the results of the target's role.",
    "goal": "Kill anyone that will not submit to the Mafia.",
    "classicResults": "Doctor, Disguiser, Serial Killer",
    "covenResults": "Doctor, Disguiser, Serial Killer, Potion Master",
    "additional": "Your disguises can fool Spies. If you disguise yourself, you will not be seen visiting your target. If you disguise a fellow Mafia member, you will be seen visiting your Mafia teammate, and your teammate will not be seen visiting another player.\n\nA disguised Mafia member will not be seen by a Lookout. Instead, the Lookout will instead see the disguise itself (example: If the Mafioso was disguised as House 1 and the Lookout watched House 2, the Lookout would be seeing House 1 instead of the Mafioso).\n\nIf there is no Godfather or Mafioso, you are eligible for promotion to Mafioso.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Forger",
    "alignment": "Mafia",
    "alignmentType": "Deception",
    "attack": "None",
    "defense": "None",
    "abilities": "Choose a person to forge, rewriting their Last Will and role at Night.",
    "attributes": "You have 2 forgeries. If your target dies that Night, your forgery will replace their Last Will and their role.",
    "goal": "Kill anyone that will not submit to the Mafia.",
    "classicResults": "Lookout, Forger, Witch",
    "covenResults": "Lookout, Forger, Juggernaut, Coven Leader",
    "additional": "If your target does not die, your forgery is wasted. Your forgery will take place effect if they die, even if they were not killed by the Mafia (unless they were Jailed and executed or Cleaned/Stoned).\n\nIf the target is Forged and Cleaned or Stoned, the Clean/Stone will take priority.\n\nIn the incredibly rare event that you were Controlled into forging a target that died but did not plan to forge anyone, the forged target will have their will removed and they will appear as the Forger.\n\nIf there is no Godfather or Mafioso, you are eligible for promotion to Mafioso.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Framer",
    "alignment": "Mafia",
    "alignmentType": "Deception",
    "attack": "None",
    "defense": "None",
    "abilities": "Choose one person to Frame each Night.",
    "attributes": "Sheriffs will see a Framed target as Suspicious and an Investigator will receive the results of a Framer. They remain Framed until they are investigated.",
    "goal": "Kill anyone that will not submit to the Mafia.",
    "classicResults": "Framer, Vampire, Jester",
    "covenResults": "Framer, Vampire, Jester, Hex Master",
    "additional": "If there is no Godfather or Mafioso, you are eligible for promotion to Mafioso.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Hypnotist",
    "alignment": "Mafia",
    "alignmentType": "Deception",
    "attack": "None",
    "defense": "None",
    "abilities": "Choose a target to give them false information. Check Additional Information for possible messages. ",
    "attributes": "The target is unaffected by the false messages you give them; if you give a false \"You were Roleblocked!\" message they will still receive their normal messages too. Spies who bug your target will receive the same false information.\n\nIf there is no Godfather or Mafioso, you are eligible for promotion to Mafioso.",
    "goal": "Kill anyone that will not submit to the Mafia.",
    "classicResults": "Escort, Transporter, Consort, Hypnotist",
    "covenResults": "Escort, Transporter, Consort, Hypnotist",
    "additional": "Coven messages are only allowed in Coven games. Classic messages can be used in Coven games.\n\nClassic:\nYou were transported to another location!\nYou were roleblocked!\nYou were attacked but someone fought your attacker!\nYou were attacked but healed!\nYou were controlled by a Witch!\n\nCoven:\nYou were poisoned. You will die tomorrow!\nYou were attacked but protected!\nSomeone tried to poison you, but you someone fought your attacker!\nYou triggered a trap!\nYou were attacked but a trap saved you!\nA trap attacked you but you were healed!",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Janitor",
    "alignment": "Mafia",
    "alignmentType": "Deception",
    "attack": "None",
    "defense": "None",
    "abilities": "Choose a person to clean, hiding their role and Last Will if they die that Night.",
    "attributes": "You have 3 cleans. If your target dies that Night, your clean will hide their Last Will and their role. You will also learn their role upon successfully cleaning them.",
    "goal": "Kill anyone that will not submit to the Mafia.",
    "classicResults": "Medium, Janitor, Retributionist",
    "covenResults": "Medium, Janitor, Retributionist, Necromancer, Trapper",
    "additional": "If your target does not die, your clean is wasted. Your clean will take effect if they die, even if they were not killed by the Mafia (unless they were Jailed and executed or Stoned).\n\nIf the target is Forged or Stoned, your Clean will take priority.\n\nIf there is no Godfather or Mafioso, you are eligible for promotion to Mafioso.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Coven Leader",
    "alignment": "Coven",
    "alignmentType": "Evil",
    "attack": "None",
    "defense": "None",
    "abilities": "You may choose to control a player each Night. If they are able to visit other players, you will make them visit and use their ability on another player.\n\nYou learn the role of the player you control, even if they are control immune. You learn if your target was control immune. If the target is a Town Investigative or Consigliere, you will receive their investigative results and they will not receive their own.",
    "attributes": "With the Necronomicon, you will gain Basic Defence and you will now also deal a Basic Attack to player you control.\n\nYour target will learn they were controlled.\n\nThe Coven Leader has the highest priority to get the Necronomicon.",
    "goal": "Kill all who would oppose the Coven.",
    "classicResults": "N/A",
    "covenResults": "Lookout, Forger, Juggernaut, Coven Leader",
    "additional": "Coven Leader has Roleblock Immunity.\n\nIf the first target is Jailed, the control will fail.\n\nIf the Coven Leader is transported with their first target and ends up controlling themselves, they will simply visit their second target with no effect.\n\nCoven Leaders are not required to be in a Coven game.",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Hex Master",
    "alignment": "Coven",
    "alignmentType": "Evil",
    "attack": "Unstoppable",
    "defense": "None",
    "abilities": "You may choose to Hex a player each Night.\n\nIf the night ends with every non-Coven member Hexed, the Final Hex automatically happens and deals an Unstoppable Attack to everyone that is Hexed.",
    "attributes": "Hexed players will appear as suspicious to the Sheriff. They will also show up under the Hex Master's results to an Investigator and Consigliere.\n\nWith the Necronomicon, your Hex ability also deal a Basic Attack and is Astral.",
    "goal": "Kill all who would oppose the Coven.",
    "classicResults": "N/A",
    "covenResults": "Framer, Vampire, Jester, Hex Master",
    "additional": "The Final Hex happens even if the Hex Master is roleblocked or die on the night it happens.\n\nIn the rare event a Hex Master tries to Hex another Coven member, that member will become Hexed. They will die to the Final Hex.",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Medusa",
    "alignment": "Coven",
    "alignmentType": "Evil",
    "attack": "Powerful",
    "defense": "None",
    "abilities": "You may choose to Stone Gaze at Night, turning everyone who visits you to stone, erasing their role and Last Will.\n\nIf you have the Necronomicon, you can visit other players, turning only your target to Stone.",
    "attributes": "Medusa can be roleblocked to prevent Stone Gaze. You can only Stone Gaze at home 3 times per game. If you have the Necronomicon, you can visit other players infinitely.\n\nMedusa has the lowest priority to get the Necronomicon.",
    "goal": "Kill all who would oppose the Coven.",
    "classicResults": "N/A",
    "covenResults": "Survivor, Vampire Hunter, Amnesiac, Medusa, Psychic",
    "additional": "Unlike the Veteran, the Medusa does not gain Basic Defence when Gazing.\n\nIf the target is also cleaned by a Janitor, the Clean will take priority.",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Necromancer",
    "alignment": "Coven",
    "alignmentType": "Evil",
    "attack": "None",
    "defense": "None",
    "abilities": "At night, raise a dead player as a zombie and have them use their ability on your behalf. You have priority over the Retributionist. Check additional information for a full list of ineligible roles.\n\nWith the Necronomicon, you may perform an Astral Basic Attack instead.",
    "attributes": "Once a dead player has been used by the Necromancer or the Retributionist, it can no longer be used.\n\nA Tracker will see you visit the house of the dead player you want to use. And a Lookout will see the dead player you used visit your second target.",
    "goal": "Kill all who would oppose the Coven.",
    "classicResults": "N/A",
    "covenResults": "Medium, Janitor, Retributionist, Necromancer, Trapper",
    "additional": "Necromancer has Roleblock and Control Immunity.\n\nNecromancer cannot use these roles:\nTown Support (except Escort)\nExecutioner or Jester\nJailor\nVeteran\nTrapper\nSurvivor\nAmnesiac\nPirate\nCoven Leader\nMedusa\nPotion Master\n\nSince the Pestilence will also rampage at their own house and you will visit them when using their role, you will also be attacked by the Pestilence.\n\nImportant: Community roles may have their own restrictions. Check the additional information for individual Community roles to see where restrictions apply.",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Poisoner",
    "alignment": "Coven",
    "alignmentType": "Evil",
    "attack": "Basic",
    "defense": "None",
    "abilities": "You may choose to Poison a player each Night. Poison may only be cured by a Doctor, Potion Master or Guardian Angel.\n\nIf your target has no defence, the target will be poisoned and will die the next day.",
    "attributes": "Players learn if they are poisoned. If your poisoned target gains any form of defence the next Night (such as self-vesting or Jail), the target will still die to Poison unless they were healed.\n\nWith the Necronomicon, Doctors and the Potion Master can no longer cure Poison. Players will learn that their Poison cannot be healed. Guardian Angel can still remove Poison.",
    "goal": "Kill all who would oppose the Coven.",
    "classicResults": "N/A",
    "covenResults": "Sheriff, Executioner, Werewolf, Poisoner",
    "additional": "Poisoning is considered an attack and you will be attacked by traps and Bodyguards.",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Potion Master",
    "alignment": "Coven",
    "alignmentType": "Evil",
    "attack": "Basic",
    "defense": "None",
    "abilities": "You may use one of three potions:\nHealing potions give your target Powerful Defence and cures poison.\nRevealing potions reveal your target's role to you.\nAttacking potions deal a basic attack to your target.\n",
    "attributes": "Each potion has a 3 day cooldown. With the Necronomicon, your potions no longer have cooldowns.\n\nHealing potions cannot be used on yourself but you can use it on other members of the Coven.\nRevealing potions are not fooled by Frames, Douses or Hexes.",
    "goal": "Kill all who would oppose the Coven.",
    "classicResults": "N/A",
    "covenResults": "Doctor, Disguiser, Serial Killer, Potion Master",
    "additional": "Potion Master has Control immunity.",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Amnesiac",
    "alignment": "Neutral",
    "alignmentType": "Benign",
    "attack": "None",
    "defense": "None",
    "abilities": "Choose a dead player at Night to become that role at the start of the next Day if you survive. This ability is Astral.",
    "attributes": "You cannot select anyone Cleaned by a janitor or Stoned by a Medusa. You will not become your chosen role if you die that Night.\n\nOnce an Amnesiac remembers what their role is, it is announced to the whole Town that 'An Amnesiac has remembered themselves as [Role]', but not who that Amnesiac is.\n\nIf an Amnesiac tries to remember someone who was Forged, they will become that person's real role instead.",
    "goal": "Remember who you are and complete that role's goal.",
    "classicResults": "Survivor, Vampire Hunter, Amnesiac",
    "covenResults": "Survivor, Vampire Hunter, Amnesiac, Medusa, Psychic",
    "additional": "If multiple Amnesiacs attempt to remember themselves as the same unique role, a random Amnesiac will succee and the others will fail.\n\nIf an Amnesiac tries to remember themselves as a unique role that already exist among living players, for example Godfather or Mafioso, the ability will fail.\n\nIf you are roleblocked or controlled, you will be unable to remember a role. However, being controlled into yourself announces to the Town that an Amnesiac has remembered being an Amnesiac.\n\nIf the game ends before you remember a role, you will lose.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Survivor",
    "alignment": "Neutral",
    "alignmentType": "Benign",
    "attack": "None",
    "defense": "None",
    "abilities": "You can choose to put on a bulletproof vest at Night, protecting yourself from Basic Attacks.",
    "attributes": "You have 4 vests. You win with anyone, simply make it to the end of the game to win.",
    "goal": "Survive until the end of the game.",
    "classicResults": "Survivor, Vampire Hunter, Amnesiac",
    "covenResults": "Survivor, Vampire Hunter, Amnesiac, Medusa, Psychic",
    "additional": "Survivor does not have Control Immunity, but the Witch cannot control whether or not they use their ability. Even if they are controlled, the Survivor can choose to equip the vest.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Executioner",
    "alignment": "Neutral",
    "alignmentType": "Evil",
    "attack": "None",
    "defense": "Basic",
    "abilities": "You have no ability. Instead you must trick the town into lynching your assigned target.",
    "attributes": "Your target is randomly assigned at the start of the game. Your target is always a Town, but cannot be Mayor or Jailor.\n\nIf your target is killed at Night, you will become a Jester.",
    "goal": "Get your assigned target lynched at any cost.",
    "classicResults": "Sheriff, Executioner, Werewolf",
    "covenResults": "Sheriff, Executioner, Werewolf, Poisoner",
    "additional": "It is not announced that the Executioner has won or lost until the end of the game.\n\nYour target has to be lynched while you are alive. If you die after your target was successdully lynched you will still win at the end of the game.\n\nThe game will end when there are no more evil roles able to kill the Town or the evil roles have no one to oppose them, even if your target is still alive.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Jester",
    "alignment": "Neutral",
    "alignmentType": "Evil",
    "attack": "None",
    "defense": "None",
    "abilities": "You have no ability. Instead you must trick the Town into voting against you.",
    "attributes": "Haunt one player who voted Guilty or Abstain when you are lynched, dealing an Unstoppable Attack to them.\n\nPestilence is immune to haunts as have Invincible Defence.",
    "goal": "Get yourself lynched by any means necessary.",
    "classicResults": "Framer, Vampire, Jester",
    "covenResults": "Framer, Vampire, Jester, Hex Master",
    "additional": "If you Haunt the Pestilence, they will not die as the Haunt is considered an Unstoppable Attack while the Pestilence have Invincible Defence. The Jester will not be able to Haunt any other players if they do so.\n\nYour haunt is not affected by Transporters. You will always Attack your chosen target.\n\nIf you survive until the end of the game, you lose. The game will end when there are no more evil roles able to kill the Town or the evil roles have no one to oppose them.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Witch",
    "alignment": "Neutral",
    "alignmentType": "Evil",
    "attack": "None",
    "defense": "None",
    "abilities": "You may choose to control a player each Night. If they are able to visit other players, you will make them visit and use their ability on another player.\n\nYou will receive all feedback your target would have otherwise received. Your target will not receive their feedback. Such as investigative ability results or attack result messages.",
    "attributes": "You have Basic Defence against only one attack. Your defence will be removed afterwards, unless you were protected or healed.\n\nYour target will learn they were controlled. You learn the role of the player you control, even if they are control immune. You learn if your target was control immune.",
    "goal": "Survive to see the Town lose the game.",
    "classicResults": "Lookout, Forger, Witch",
    "covenResults": "N/A",
    "additional": "Witch has Roleblock Immunity.\n\nIf the first target is Jailed, the control will fail.\n\nIf more than one Witch wants to control the same target, a random Witch will be able to control the target and the others will fail.\n\nIf the Witch is controlled by another Witch, then the first target of the controlled Witch will be replaced with the second target of the controlling Witch. If the Witch ends up controlling themselves, they will simply visit their second target with no effect.\n\nIf there are no more evil players that can kill, and there are no Vigilantes with rounds remaining, the Witch loses.\n\nThe Witch is not available in Coven DLC games.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Vampire",
    "alignment": "Neutral",
    "alignmentType": "Chaos",
    "attack": "Basic",
    "defense": "None",
    "abilities": "Vote on who the vampires should attempt to bite at night.\n\nIf there are less than 4 vampires, the target has no defense and they can be converted, the bite will convert the target to a vampire if they survive the night. After a successful conversation the vampires are forced to do nothing the following night.\n\nIf there are 4 or more vampires or the target cannot be converted, the bite deal a basic attack to the target.",
    "attributes": "The youngest Vampire (or random if there is none) will make the attack.\n\nOnly Town, Survivor, Amnesiac and Jester can be converted if unprotected. All other roles, including Mafia and Coven, are dealt a Basic Attack.",
    "goal": "Convert everyone who would oppose you.",
    "classicResults": "Framer, Vampire, Jester",
    "covenResults": "Framer, Vampire, Jester, Hex Master",
    "additional": "A successful Vampire conversion happens at the end of the Night if the target wasn't otherwise killed. The converted player will be made aware they are now a Vampire.\n\nVampires will vote for who to bite and the target will be chosen based on chance rather than majority vote. If 2 Vampires vote for Target A and 1 Vampire votes for Target B, there is a 67% chance of biting Target A and a 33% chance of biting Target B.\n\nIf any Vampire is controlled by a Witch, the Witch will automatically control the youngest Vampire. The youngest Vampire will learn of the control and will be forced to bite the Witch's second target.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Arsonist",
    "alignment": "Neutral",
    "alignmentType": "Killing",
    "attack": "Unstoppable",
    "defense": "Basic",
    "abilities": "Target a players to douse them in Gasoline.\n\nOr Ignite all doused targets.",
    "attributes": "You will passively douse anyone that visits you and learn their house numbers.\n\nIf you happen to become Doused, you can choose to do no action at Night to clean the gasoline off yourself. Ignites will kill you if you are doused.\n\nDoused players will show as Arsonist to Investigator and Consigliere.",
    "goal": "Live to see everyone burn.",
    "classicResults": "Bodyguard, Godfather, Arsonist",
    "covenResults": "Bodyguard, Godfather, Arsonist, Crusader",
    "additional": "Players Doused by Arsonists are not made aware they are Doused, unless they are an Arsonist themselves.\n\nWitches, Coven Leaders and Potion Masters will still learn the target's real role, even if they are Doused.\n\nArsonists controlled into themselves will result in the Arsonist dousing themselves, or if they were tricked into targeting themselves by the Transporter.\n\nContrary to its goal, Arsonists win with other Arsonists. If an Arsonist is dead but another Arsonist wins, the dead Arsonist wins with them.\n\nIf there are multiple Arsonists, they only know who they've Doused themselves. If one of the Arsonists ignite, all Doused players by all Arsonists will be attacked.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Serial Killer",
    "alignment": "Neutral",
    "alignmentType": "Killing",
    "attack": "Basic",
    "defense": "Basic",
    "abilities": "Attack someone with a Basic Attack each Night.",
    "attributes": "Serial Killers can choose to go Cautious. If you choose not to go Cautious, you will attack the roleblocker and your target. If you have been Jailed or Pirated, you will only be allowed to kill them (if you do not go Cautious).\n\nRoleblockers and Jailors that Roleblocked/Jailed the Serial Killer and was killed by them will have no Last Will.",
    "goal": "Kill everyone who would oppose you.",
    "classicResults": "Doctor, Disguiser, Serial Killer",
    "covenResults": "Doctor, Disguiser, Serial Killer, Potion Master",
    "additional": "Serial Killer has Roleblock Immunity, but only against Escort and Consort.\n\nIf a non-Cautious Serial Killer is roleblocked by an Escort or Consort, they will kill the Escort/Consort along with their intended target and the Escort/Consort will have their Last Will 'bloodied'.\n\nIf a non-Cautious Serial Killer is Jailed or Dueled by a Jailor or Pirate, but they don't kill the Serial Killer, the Serial Killer will kill Jailor/Pirate and the Jailor/Pirate will have their Last Will 'bloodied'.\n\nA 'bloodied' Last Will cannot be read.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Werewolf",
    "alignment": "Neutral",
    "alignmentType": "Killing",
    "attack": "Powerful",
    "defense": "Basic",
    "abilities": "Go on a rampage every Full Moon, dealing a Powerful Attack to your target and any visitors to them.\n\nIf you stay home or don't take any action, you will attack any visitors to your house instead.",
    "attributes": "On a full moon, if you are roleblocked, you will be forced to stay at home and attack all visitors to you, including the roleblocker.\n\nOn a full moon, if you are jailed and not executed, you are forced to attack the Jailor and any visitors to them.",
    "goal": "Kill everyone who would oppose you.",
    "classicResults": "Sheriff, Executioner, Werewolf",
    "covenResults": "Sheriff, Executioner, Werewolf, Poisoner",
    "additional": "Full Moon is on Night 2 and then Night 4 onwards.\n\nWerewolves appear Not Suspicious to the Sheriff on a non-Full Moon, but appear Suspicious on a Full Moon.",
    "dlc": false,
    "unique": true
  },
  {
    "name": "Guardian Angel",
    "alignment": "Neutral",
    "alignmentType": "Benign",
    "attack": "None",
    "defense": "None",
    "abilities": "Choose to protect your assigned target, giving them Powerful Defence, protecting from Jailor's execution and purging any negative effects for the Night. Your protection is Astral.\n\nPurge removes Douse, Hex and Poison (even if the Poisoner has Necronomicon).",
    "attributes": "You are randomly assigned a target at the start of the game. Your assigned target cannot be an Executioner, Jester or another Guardian Angel.\n\nYou only have 2 protections. When you protect your assigned target, they cannot be voted up for trial the following day and it is announced they were protected.\n\nIf you die, you can still protect your target from the grave. If your target dies, you become a Survivor without vests.",
    "goal": "Keep your assigned target alive until the end of the game.",
    "classicResults": "N/A",
    "covenResults": "Spy, Blackmailer, Jailor, Guardian Angel",
    "additional": "It is possible for your target to be an Amnesiac and remember themselves as an Executioner, Jester or another Guardian Angel and you will still be required to protect them.\n\nYou can save your target from a Jailor's execution. However, the Guardian Angel cannot save their target from an attack by a Level 3 Juggernaut, a Vigilante committing suicide, a Jester haunt or the Hex Master's Final Hex.\n\nIf the Guardian Angel is controlled by a Coven Leader or Necromancer, they will be forced to use one of their protections on their target if they have any remaining.\n\nPurge does not remove the effects of a Framer's Frame, or Plaguebearer's Infection.",
    "dlc": true,
    "unique": false
  },
  {
    "name": "Pirate",
    "alignment": "Neutral",
    "alignmentType": "Chaos",
    "attack": "Powerful",
    "defense": "None",
    "abilities": "Choose one person to challenge them to a duel. Dueling them will roleblock your target. Winning the duel will successfully plunder them and deal a Powerful Attack to your target.\n\nYou cannot target the same player twice in a row.",
    "attributes": "You will challenge them to a game of Rock, Paper, Scissors.\nYour Options: Scimitar, Rapier, Pistol\nTarget Options: Sidestep, Chainmail, Backpedal\n\nScimitar beats Sidestep, Rapier beats Chainmail, Pistol beats Backpedal.\n\nYou must win the duel to plunder them. In the event of a draw, you will lose.",
    "goal": "Successfully plunder two players.",
    "classicResults": "N/A",
    "covenResults": "Vigilante, Veteran, Mafioso, Pirate, Ambusher",
    "additional": "Pirate has Roleblock and Control Immunity.\n\nDueling players is considered a Day Ability. This means that duels cannot be prevented in any way, unless the target is Jailed.\n\nBodyguards and Traps will only attack you if the you win the duel. Serial Killers who are not Cautious will kill you if you lose the duel. Werewolves on a Full Moon will automatically kill you, regardless of if you win or lose the duel.\n\nYou don't need to be alive in order to win. If you successfully plunder 2 players before you die, you will still win at the end of the game, even if you died the same Night you got your second plunder.",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Plaguebearer",
    "alignment": "Neutral",
    "alignmentType": "Chaos",
    "attack": "None",
    "defense": "Basic",
    "abilities": "Choose to infect a player with the plague each Night. Once all players are infected, you become Pestilence.\n\nYou will passively infect all visitors to you.",
    "attributes": "You become Pestilence if you survive to the end of the Night once all remaining players for that Night are infected. Pestilence's arrival is announced.\n\nInfected players visiting other houses will infect that house and all visitors to it. Anyone who visits an infected player directly will also become infected themselves. Players are not made aware that they've been infected.",
    "goal": "Infect all living players and become Pestilence.",
    "classicResults": "N/A",
    "covenResults": "Investigator, Consigliere, Mayor, Tracker, Plaguebearer",
    "additional": "In the rare event that the Plaguebearer is the last one standing, they can achieve a 'Plaguebearer' win. They are not required to become Pestilence.\n\nPlaguebearer learns the names of all who is infected at the end of the Night.",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Pestilence",
    "alignment": "Neutral",
    "alignmentType": "Chaos",
    "attack": "Powerful",
    "defense": "Invincible",
    "abilities": "Choose to rampage at a player's house each night. You deal a Powerful Attack to all visitors to your target and also visitors to you simultaneously.",
    "attributes": "You cannot be killed at Night by any means, including Jailor's execution or Jester's haunt.\n\nIf someone attempts to roleblock you, you will attack the roleblocker and still be able to rampage at your target's house. If you are Jailed, you are forced to rampage the Jailor.",
    "goal": "Kill everyone who would oppose you.",
    "classicResults": "N/A",
    "covenResults": "Investigator, Consigliere, Mayor, Tracker, Plaguebearer",
    "additional": "Pestilence has Roleblock and Control Immunity.\n\nUnlike the Juggernaut or Werewolf, Pestilence is able to rampage at their own house and their target's house simultaneously.",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Juggernaut",
    "alignment": "Neutral",
    "alignmentType": "Killing",
    "attack": "Powerful",
    "defense": "Basic",
    "abilities": "Attack a player and gain new abilities with every kill. Read attributes for more information.",
    "attributes": "No kills: You can only attack on Full Moon.\n1 kill: You can now attack every Night.\n2 kills: You now rampage at your target's house when attacking.\n3 kills: Unstoppable attack. You can kill Jailed targets and ignore Guardian Angel protection.",
    "goal": "Kill everyone who would oppose you.",
    "classicResults": "N/A",
    "covenResults": "Lookout, Forger, Juggernaut, Coven Leader",
    "additional": "",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Commander",
    "alignment": "Alien",
    "alignmentType": "Killing",
    "attack": "Basic",
    "defense": "Basic",
    "abilities": "Choose who to attack at Night. If an Invader is alive, they will attack the target for you.",
    "attributes": "You have Basic Defence and will appear innocent to a Sheriff. If an Invader is Roleblocked or Jailed, or there is no Invader, you will carry out the attack yourself.",
    "goal": "Kill those that stand in the way of the Aliens.",
    "classicResults": "N/A",
    "covenResults": "Bodyguard, Godfather, Arsonist, Crusader, Commander",
    "additional": "Created by Milo\n\nThey are innocent to the Sheriff and are considered Evil to the Psychic.",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Invader",
    "alignment": "Alien",
    "alignmentType": "Killing",
    "attack": "Basic",
    "defense": "None",
    "abilities": "Choose a target to attack at Night. If there is a Commander, anyone they pick overrides your decision.",
    "attributes": "If you start as Invader and there is a Commander, you become Commander when they are killed as long as the Mothership is in orbit. Promoted Invaders cannot be come Commander. If they are Roleblocked, you will attack your own target instead.",
    "goal": "Kill those that stand in the way of the Aliens.",
    "classicResults": "N/A",
    "covenResults": "Vigilante, Veteran, Mafioso, Invader, Ambusher",
    "additional": "Created by Milo\n\nInvader is Suspicious to the Sheriff and is considered Evil to the Psychic.\n\nThe Mothership is in orbit starting from Night 4.",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Abductor",
    "alignment": "Alien",
    "alignmentType": "Killing",
    "attack": "Basic",
    "defense": "None",
    "abilities": "Choose someone to kidnap for the Night, roleblocking them and alerting them that they've been kidnapped. With the Mothership, you now attack your roleblocked target with 1 day cooldown between attacks.",
    "attributes": "Roleblocks have no cooldown. Your target and their visitors will be aware they were abducted.",
    "goal": "Kill those that stand in the way of the Aliens.",
    "classicResults": "N/A",
    "covenResults": "Escort, Transporter, Consort, Hypnotist, Abductor",
    "additional": "Created by Milo\n\nAbductor is Suspicious to the Sheriff and is considered Evil to the Psychic.\n\nThe Mothership is in orbit starting from Night 4.\n\nIf there is no Commander or Invader, you are eligible for promotion to Invader.",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Liaison",
    "alignment": "Alien",
    "alignmentType": "Intelligence",
    "attack": "None",
    "defense": "None",
    "abilities": "This role has been temporarily disabled as its ability has been made redundant with the new Whisper mechanic.\n\n(Previous ability: Hear the contents of all whispers, even while dead.)",
    "attributes": "While dead, you cannot speak with the deceased. When the Mothership is in orbit, while dead, you can continue to talk during Alien meetings.",
    "goal": "Kill those that stand in the way of the Aliens.",
    "classicResults": "N/A",
    "covenResults": "Medium, Janitor, Retributionist, Liaison, Trapper",
    "additional": "Created by Milo\n\nLiaison is Suspicious to the Sheriff and is considered Evil to the Psychic.\n\nThis role has been disabled for the same reason as the Blackmailer since both roles are no longer allowed to hear whispers.\n\nIf there is no Commander or Invader, you are eligible for promotion to Invader.",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Prober",
    "alignment": "Alien",
    "alignmentType": "Intelligence",
    "attack": "Powerful",
    "defense": "None",
    "abilities": "Learn your target's exact role and receive the same end of Night information as your target, but not who they targeted.",
    "attributes": "Your Probe will fail if the target is in Jail. If you Probe the same target as the Mutator, you will see your target as the Mutator, but still receive any of their information.",
    "goal": "Kill those that stand in the way of the Aliens.",
    "classicResults": "N/A",
    "covenResults": "Spy, Blackmailer, Jailor, Prober, Guardian Angel",
    "additional": "Created by Milo\n\nProber is Suspicious to the Sheriff and is considered Evil to the Psychic.\n\nIf there is no Commander or Invader, you are eligible for promotion to Invader.",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Scanner",
    "alignment": "Alien",
    "alignmentType": "Intelligence",
    "attack": "None",
    "defense": "None",
    "abilities": "Learn where your target visits. If the Mothership is in orbit, you can also learn who visited your target. You can Scan Aliens while it is in orbit.",
    "attributes": "You will passively learn all visits to yourself. Your ability is Astral so you do not visit the target to learn results. Your abilities can be roleblocked if you are bugged by a Spy, who will also learn that their bug has failed due to interference.",
    "goal": "Kill those that stand in the way of the Aliens.",
    "classicResults": "N/A",
    "covenResults": "Lookout, Forger, Juggernaut, Scanner",
    "additional": "Created by Milo\n\nScanner is Suspicious to the Sheriff and is considered Evil to the Psychic.\n\nThe Mothership is in orbit starting from Night 4.\n\nIf there is no Commander or Invader, you are eligible for promotion to Invader.",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Mind Controller",
    "alignment": "Alien",
    "alignmentType": "Manipulation",
    "attack": "Basic",
    "defense": "None",
    "abilities": "Possess your target's body to make them a Vessel.",
    "attributes": "You will make your target a Vessel if you successfully attack them. If you fight a protective role guarding them, you won't make them a Vessel. If successful, you will go 'Missing'.",
    "goal": "Kill those that stand in the way of the Aliens.",
    "classicResults": "N/A",
    "covenResults": "Framer, Vampire, Jester, Mind Controller",
    "additional": "Created by Milo\n\nMind Controller is Suspicious to the Sheriff and is considered Evil to the Psychic.\n\nGoing 'Missing' means the Mind Controller will be cleaned of their role and will, but will not be allowed to talk with the deceased as they are not considered dead.\n\nThe theme of the Mind Controller is that they leave their body to control the mind of another player, using their body as a 'Vessel'.\n\nIf there is no Commander or Invader, you are eligible for promotion to Invader.",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Minion",
    "alignment": "Alien",
    "alignmentType": "Manipulation",
    "attack": "None",
    "defense": "None",
    "abilities": "Protect a fellow Alien. If they are killed or lynched that day, you will swap roles with them, making them appear as Minion and you become their role.",
    "attributes": "If you protect the original Invader and become them, you also become the Original Invader and are eligible for promotion.",
    "goal": "Kill those that stand in the way of the Aliens.",
    "classicResults": "N/A",
    "covenResults": "Sheriff, Executioner, Werewolf, Minion",
    "additional": "Created by Milo\n\nMinion is Suspicious to the Sheriff and is considered Evil to the Psychic.\n\nIf there is no Commander or Invader, you are eligible for promotion to Invader.",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Mutator",
    "alignment": "Alien",
    "alignmentType": "Manipulation",
    "attack": "None",
    "defense": "None",
    "abilities": "Choose a person to swap roles with each Night. You will appear as their role and they will appear as the Mutator.",
    "attributes": "You do not learn the role that you swapped with. The Investigator and Sheriff will see you as your target's role, and see your target as the Mutator. If you or your target dies on the same Night or either of you are lynched, both players will appear as their swapped roles that Day.",
    "goal": "Kill those that stand in the way of the Aliens.",
    "classicResults": "N/A",
    "covenResults": "Doctor, Disguiser, Serial Killer, Mutator",
    "additional": "Created by Milo\n\nMinion is Suspicious to the Sheriff and is considered Evil to the Psychic.\n\nIf there is no Commander or Invader, you are eligible for promotion to Invader.",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Vessel",
    "alignment": "Alien",
    "alignmentType": "Manipulation",
    "attack": "None",
    "defense": "None",
    "abilities": "No Ability.",
    "attributes": "You body is the Vessel of the Mind Controller.\nYou have the lowest priority to become an Invader.",
    "goal": "Kill those that stand in the way of the Aliens.",
    "classicResults": "N/A",
    "covenResults": "Survivor, Vampire Hunter, Amnesiac, Vessel, Psychic",
    "additional": "Created by Milo\n\nVessel is Suspicious to the Sheriff and is considered Evil to the Psychic.\n\nIf there is no Commander or Invader, you are eligible for promotion to Invader.",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Cthulhu",
    "alignment": "Neutral",
    "alignmentType": "Chaos",
    "attack": "None",
    "defense": "Basic",
    "abilities": "Drive your target insane and force them to say a specific word or phrase at day and prevent them from being allowed to whisper. This is an astral ability.\n\nYou can drive Jailed targets insane, on top of learning they were jailed.",
    "attributes": "If you are jailed and not executed, you are forced to use your ability on the Jailor. Pestilence cannot be driven insane.\n\nCthulhu only wins with the Coven or any Neutral. If the target does not say the phrase at least once or says anything else, they will be immediately killed on the spot (Cthulhu is meant to be forced). Cthulhu's targets cannot do gestures to communicate.\n\nNote: The Host has full discretion as to what is and is not permitted to say. Please keep phrases short, easy to remember and inoffensive.",
    "goal": "Survive to see the Town and Mafia lose the game.",
    "classicResults": "N/A",
    "covenResults": "Framer, Vampire, Jester, Cthulu, Hex Master",
    "additional": "Created by Milo\nCthulhu is the only permanent Community role.\n\nCthulhu is a Unique role. There cannot be more than one.\n\nCthulhu has Roleblock and Control Immunity. They are Not Suspicious to the Sheriff and are considered Evil to the Psychic.\n\nIf a target is both driven insane and Blackmailed, the Insanity takes priority.\n\nCthulhu can force Mayor to reveal by making them say 'I reveal as Mayor'.\n\nThe phrase must at least be clearly heard by the host. It does not have to be heard by everyone.\n\nIf there are no more evil players that can kill, the Cthulhu loses.",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Blacksmith",
    "alignment": "Town",
    "alignmentType": "Protective",
    "attack": "None",
    "defense": "None",
    "abilities": "If you have available Armour, choose a player to give them Armour, upgrading their Defence by one level against one attack.\n\nIf you have no Armour, you will forge it. Armour take one Night to forge; they are forged automatically at the end of the Night.",
    "attributes": "You can choose to give yourself Armour once.\n\nYou can only upgrade their Defence to Powerful. If your target's defence is already Powerful, you will still give them Armour to no effect.\n\nBoth upgrade levels will be removed if they get attacked once and will the player will return to their original level of defence.",
    "goal": "Lynch every criminal and evildoer.",
    "classicResults": "Bodyguard, Godfather, Arsonist, Blacksmith",
    "covenResults": "Bodyguard, Godfather, Arsonist, Crusader, Blacksmith",
    "additional": "Created by MemeFromBeyond\nMost voted Community Role of Season 3\n\nBlacksmith has Control Immunity. They are Not Suspicious to the Sheriff and are considered Good to the Psychic. They cannot be used by the Necromancer.\n\nBlacksmith start the game with no available Armour.\n\nIf the target was attacked by multiple targets with varying levels of attack, the Armour will protect from the highest level of Defence.\n\nExample:\u000bGodfather was upgrade to Powerful. Werewolf and Serial Killer attacks the Godfather.\nThe Armour will protect against the Werewolf's attack first since they have a higher attack (Powerful) compared to the Serial Killer (Basic).\nThe Godfather loses his Armour and returns to his original level of Defence (Basic).\nThe Serial Killer's attack against the Godfather will then fail because the Godfather has Basic Defence and the Serial Killer has Basic Attack.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Negotiator",
    "alignment": "Mafia",
    "alignmentType": "Support",
    "attack": "None",
    "defense": "None",
    "abilities": "Choose one player to invite to join the Mafia. If they are a Town, they will be given an option to join or decline.\n\nIf the target is not Town, they will be notified they were offered to join, but won't be able to accept.",
    "attributes": "If the target accepts, this will change their win condition to that of the Mafia; they will keep their original role along with its ability and attributes. \"Someone has betrayed the town\" is announced the morning after and your role will change to Consigliere.\n\nConverted Town will not be able to take part in Mafia meetings, but is told who the Mafia are.",
    "goal": "Kill anyone that will not submit to the Mafia.",
    "classicResults": "Investigator, Consigliere, Mayor, Negotiator",
    "covenResults": "Investigator, Consigliere, Mayor, Tracker, Plaguebearer, Negotiator",
    "additional": "Created by Bluesky3010\n\nNegotiator has control immunity. They are Suspicious to the Sheriff and are considered Evil to the Psychic. They cannot be used by the Necromancer.\n\nPlayers who accept to join the Mafia will keep their original role along with its ability and attributes. Example: a Vigilante joins the Mafia, if they shoot a Town, they will still commit suicide. If the traitor die it is not announced that they were a traitor.\n\nNote: It's strongly advised to use one less Mafia member when adding a Negotiator to the rolelist!",
    "dlc": false,
    "unique": true
  },
  {
    "name": "Bouncer",
    "alignment": "Mafia",
    "alignmentType": "Support",
    "attack": "None",
    "defense": "None",
    "abilities": "Choose one person to stand guard outside their house each Night, roleblocking one random visitor.",
    "attributes": "You will roleblock one random visitor. All visitors, including your victim, will learn they saw a Bouncer guarding the target, but not who you are.\n\nYou are allowed to stand guard outside your own Mafia's house.",
    "goal": "Kill anyone that will not submit to the Mafia.",
    "classicResults": "Lookout, Bouncer, Forger, Witch",
    "covenResults": "Lookout, Bouncer, Forger, Juggernaut, Coven Leader",
    "additional": "Created by ^Red^ and Milo\n\nBouncer has Roleblock Immunity. They are Suspicious to the Sheriff and are considered Evil to the Psychic.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Suicide Bomber",
    "alignment": "Neutral",
    "alignmentType": "Benign",
    "attack": "Unstoppable",
    "defense": "None",
    "abilities": "At Night, choose to detonate yourself to set off a bomb and kill yourself deal an Unstoppable Attack to all visitors to you.\n\nYou cannot detonate on the first Night.",
    "attributes": "You need to kill at least two people to win. Having two or more visitors to you but only one person killed will not count as a win.",
    "goal": "Take 2 people down with you.",
    "classicResults": "Jester, Suicide Bomber, Vampire, Framer",
    "covenResults": "Jester, Suicide Bomber, Vampire, Framer, Hex Master",
    "additional": "Created by Jailer313\n\nSuicide Bomber has Roleblock Immunity. They are Not Suspicious to the Sheriff and are considered Evil to the Psychic.",
    "dlc": false,
    "unique": false
  },
  {
    "name": "Concordist",
    "alignment": "Neutral",
    "alignmentType": "Chaos",
    "attack": "Unstoppable",
    "defense": "Basic",
    "abilities": "Choose to entrance a player with music each Night, increasing their Trance level and all visitors to the target.\n\nYou will passively entrance all visitors to you.",
    "attributes": "You will learn the names and levels of all Entranced players. All Trance effects occur at the end of the Night.\n\nIf the Jailor is on Trance II and they jail you, they are unable to execute you even if they try. You will be forced to visit the Jailor and entrance him and his visitors, raising their Trance levels.\n\nYou cannot target yourself. To stay home, do Nothing.",
    "goal": "Kill everyone who would oppose you.",
    "classicResults": "N/A",
    "covenResults": "Sheriff, Executioner, Werewolf, Poisoner, Concordist",
    "additional": "Created by DarkHandman\n\nConcordist has Control Immunity. They are Suspicious to the Sheriff and are considered Evil to the Psychic.\n\nConcordist is not Roleblock Immune (unless the Roleblocker is on Trance I), but will still increase the Trance of everyone who visits them, including the Roleblocker.\n\nTrance I:\n-You gain Roleblock Immunity from this player and appear Innocent to Sheriffs and Psychics in Trance I.\n\nTrance II:\n-Jailor cannot execute you; you will instead increase their chance along with their visitors.\n-Your visits are Astral to this player, you will not visit them or they will not see you visit.\n-While on trial, Guilty votes by this player are flipped to Innocent.\n\nTrance III:\n-The player is dealt an Unstoppable Attack with the cause of Brain Death. This is instant and cannot be saved by Guardian Angel.\n\nIf the Town becomes unable to lynch the Concordist and there are no more roles remain that are able to kill them, the Concordist will automatically win.",
    "dlc": true,
    "unique": true
  },
  {
    "name": "Puppet Master",
    "alignment": "Neutral",
    "alignmentType": "Chaos",
    "attack": "Basic",
    "defense": "Basic",
    "abilities": "If you have a Puppet, attack a player Each Night. If you have no Puppet, choose a target each Night to make them a Puppet. You will always make them a Puppet, regardless of their role.\n\nPuppet Master making new Puppets or ordering them to attack can be Roleblocked. Making new puppets and controlling them is an Astral ability.",
    "attributes": "Your target will not learn if they have become a Puppet. Your Puppet will do a Basic Attack on your behalf, regardless of their role. Your target will do their own action alongside their attack and will be unaware they are making attacks.\n\nThe Puppet appears Suspicious and gives the Puppet Master results to the Investigator. If the Puppet dies, it's announced they were a Puppet.\n\nYour Puppet can win with you or their original team, but you can only win with your Puppet. If there are only 3 players remaining and one of them is your Puppet, it becomes an automatic Puppet Master win.",
    "goal": "Kill everyone who would oppose you and your Puppet.",
    "classicResults": "N/A",
    "covenResults": "Framer, Vampire, Jester, Puppet Master, Hex Master",
    "additional": "Created by Lord_Rhys\nVoted the Community Favourite of Season 2\n\nPuppet Master has Control Immunity. They are Not Suspicious to the Sheriff and are considered Evil to the Psychic. They cannot be used by the Necromancer.\n\nIf your Puppet is Roleblocked but you order them to attack, they will only be blocked from performing their own role's ability but still will go through with the Puppet Master's order.",
    "dlc": true,
    "unique": true
  }
]
