[
   {
      "name":"Investigator",
      "alignment":"Town",
      "alignmentType":"Investigative",
      "attack":"None",
      "defense":"None",
      "abilities":"Investigate someone each Night to receive a list of their possible roles.",
      "attributes":"A Framer, Disguiser, Arsonist or Hex Master can throw off your results.\n\nYou can find possible Investigative results of a role in each role's Additional Information.",
      "goal":"Lynch every criminal and evildoer.",
      "classicResults":"Investigator, Consigliere, Mayor",
      "covenResults":"Investigator, Consigliere, Mayor, Tracker, Plaguebearer",
      "additional":"Manipulated results are in the priority of Frames/Hexes > Douses > Disguises.\n\nImportant: Community roles are not official so please check Community roles themselves for modified results.\n\nThe results given to the Investigator static depending on the role of the target, there is no randomness involved. If you investigate a Werewolf, you will always get the result 'Sheriff/Executioner/Werewolf', unless the Werewolf has been framed, doused or hexed.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Lookout",
      "alignment":"Town",
      "alignmentType":"Investigative",
      "attack":"None",
      "defense":"None",
      "abilities":"Watch someone at Night to see who visits them. You will learn their house numbers.",
      "attributes":"If 4 or more people visit, you will only know 3 of the visitors at random. You will know if there are more than 3 visitors.\n\nLookout is a visiting role; they will visit their target to use their ability.",
      "goal":"Lynch every criminal and evildoer.",
      "classicResults":"Lookout, Forger, Witch",
      "covenResults":"Lookout, Forger, Juggernaut, Coven Leader",
      "additional":"Disguises can fool Lookouts. Check Disguiser's additional information to learn more.\n\nIn the rare event that the Lookout's target was Seanced by a dead Medium, the Lookout will spot the dead Medium visiting the target.\n\nAlso in the rare event that the Lookout's target was visited by a Retributionist or Necromancer's raised target, the Lookout will see the house of the dead player visiting. Example: Retributionist in House 1 uses the dead Vigilante in House 2 to visit House 3, the Lookout will see 2 visit 3.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Sheriff",
      "alignment":"Town",
      "alignmentType":"Investigative",
      "attack":"None",
      "defense":"None",
      "abilities":"Check one person each Night and learn if they are Supsicious. Check additional information for a list of roles that appears Suspicious.",
      "attributes":"A Framer, Disguiser and Hex Master can throw off your results.",
      "goal":"Lynch every criminal and evildoer.",
      "classicResults":"Sheriff, Executioner, Werewolf",
      "covenResults":"Sheriff, Executioner, Werewolf, Poisoner",
      "additional":"Not Suspicious:\nAll Townies\nGodfather\nAll Neutrals except Serial Killer\nWerewolf during Non-Full Moon\nCoven members with the Necronomicon\n\nSuspicious:\nAll Mafia except Godfather\nSerial Killer\nWerewolf on Full Moon\nAll Coven without the Necronomicon\nAnyone Framed or Hexed\n\nImportant: Community roles may have their own exceptions. For individual Community roles check additional information to see where exceptions apply.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Spy",
      "alignment":"Town",
      "alignmentType":"Investigative",
      "attack":"None",
      "defense":"None",
      "abilities":"Choose a player each Night to place a bug at their house. You will learn of all messages they get about actions taken against them that Night. Such as; \"you were roleblocked\", \"you were transported\", \"you were attacked but healed\", \"you were controlled but you were immune\", etc.",
      "attributes":"Get a list of all targets visited by all members of the Mafia and Coven each Night, along with how many visited each target.",
      "goal":"Lynch every criminal and evildoer.",
      "classicResults":"Spy, Blackmailer, Jailor",
      "covenResults":"Spy, Blackmailer, Jailor, Guardian Angel",
      "additional":"Your ability to see Mafia/Coven visits are unaffected by Transporters and will always display who the Mafia or Coven actually visit that Night. You will also be able to see Astral visits from the Coven (Hex Master with Necronomicon); but if a Disguiser Disguises a Mafia member as a Town, you will not see their visits.\n\nIn the Town Traitor game mode, you cannot see who the Town Traitor visits.\n\nIf you are roleblocked or jailed, you will not receive the results of your bug or the visits. If you are controlled, you will bug the controller's target, and the controller will get the Mafia and/or Coven visits along with feedback from the bug.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Jailor",
      "alignment":"Town",
      "alignmentType":"Killing",
      "attack":"Unstoppable",
      "defense":"None",
      "abilities":"Choose someone during each day to jail for the Night and speak with them. This is done using the pop-up menu during any of the day phases.\n\nThe Jailor will have a text chat with their jailed target anonymously during the night. The text chat can be found on the action board, simply click to write a message.",
      "attributes":"You have 3 executions. You cannot execute on the first Night. If you execute a member of the Town faction or you run out of executions, you will not be able to execute anymore.\n\nJailing a target will grant them Powerful Defence. Anyone who targets the Jailed player with a non-attack ability will learn that their target is in jail and their ability will fail. If the Jailed player is attacked they will learn they were attacked.",
      "goal":"Lynch every criminal and evildoer.",
      "classicResults":"Spy, Blackmailer, Jailor",
      "covenResults":"Spy, Blackmailer, Jailor, Guardian Angel",
      "additional":"Jailing a player is a Day Ability, and cannot be prevented or blocked. However, if the Jailor is roleblocked, then they are prevented from executing their Jailed target.\n\nWhen controlled to visit your Jailed target you are forced to execute them if able, if controlled to visit any other target you are prevented from executing.\n\nInformation you learn from your Jailed target can be used in your Last Will.\n\nThe Jailor's target will be complete unable to use any ability, except for Serial Killer's Cautious ability. If they are a faction member, they can listen to the meeting but they cannot speak.",
      "dlc":false,
      "unique":true,
      "community":false,
      "color":null
   },
   {
      "name":"Vampire Hunter",
      "alignment":"Town",
      "alignmentType":"Killing",
      "attack":"Basic",
      "defense":"None",
      "abilities":"Check someone each Night to see if they are a Vampire. If the target is a Vampire, you will stake them with a Basic Attack.",
      "attributes":"If you are visited by a Vampire, you will not be converted and you will also stake them simultaneously with a Basic Attack.\n\nYou will become a Vigilante with only one bullet when all Vampires are dead. You will stay as a Vigilante even if an Amnesiac remembers to be a Vampire.",
      "goal":"Lynch every criminal and evildoer.",
      "classicResults":"Survivor, Vampire Hunter, Amnesiac",
      "covenResults":"Survivor, Vampire Hunter, Amnesiac, Medusa, Psychic",
      "additional":"Due to VRChat limitations, unlike the original video game, the Vampire Hunter will not be able to listen into Vampire meetings.\n\nIf your target is converted the same Night you check them, you will not prevent the conversion nor will you stake them.\n\nIf a Vampire Hunter is jailed or roleblocked, they will still stake any Vampires visiting them.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Veteran",
      "alignment":"Town",
      "alignmentType":"Killing",
      "attack":"Powerful",
      "defense":"None",
      "abilities":"Choose to go on alert each Night. You have three alerts.",
      "attributes":"While on alert, you gain Basic Defence and will deal a Powerful Attack to all visitors. If anyone visits while on alert, you learn how many visitors you have attacked and if any of your attacks failed.",
      "goal":"Lynch every criminal and evildoer.",
      "classicResults":"Vigilante, Veteran, Mafioso, Ambusher",
      "covenResults":"Vigilante, Veteran, Mafioso, Pirate, Ambusher",
      "additional":"Veteran has Roleblock and Control Immunity.\n\nIf you are dueled by a Pirate, you can still choose to go on alert.\n\nRoles using an Astral ability are not considered visitors, they will not be attacked by an alerting Veteran. For example Hex Master with the Necronomicon.",
      "dlc":false,
      "unique":true,
      "community":false,
      "color":null
   },
   {
      "name":"Vigilante",
      "alignment":"Town",
      "alignmentType":"Killing",
      "attack":"Basic",
      "defense":"None",
      "abilities":"Choose to take justice in your own hands and shoot someone. You cannot shoot a player on the first Night.",
      "attributes":"You only have 3 bullets. If you shoot a Town, you will put your gun away and commit suicide over the guilt at the end of the next Night. Suicide cannot be prevented in any way.",
      "goal":"Lynch every criminal and evildoer.",
      "classicResults":"Vigilante, Veteran, Mafioso, Ambusher",
      "covenResults":"Vigilante, Veteran, Mafioso, Pirate, Ambusher",
      "additional":"If the Vigilante is controlled, they will be forced to shoot, even if it's the first Night. If the Vigilante has already shot a Town and is going to commit suicide, they cannot shoot again even if controlled that Night.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Bodyguard",
      "alignment":"Town",
      "alignmentType":"Protective",
      "attack":"Powerful",
      "defense":"None",
      "abilities":"Choose someone to protect at Night. If your target is attacked, you will protect them from one attacker, followed by you dealing a Powerful Attack to the attacker and yourself.\n\nOnce per game, you can choose to put on a vest to protect yourself, granting yourself Basic Defence for one Night.",
      "attributes":"If you successfully protect your target from an attack, you and your target will learn they were attacked but protected.\n\nYou can only defend your target against one attack. If your target is attacked by multiple attackers at once, you will protect against one of them at random.",
      "goal":"Lynch every criminal and evildoer.",
      "classicResults":"Bodyguard, Godfather, Arsonist",
      "covenResults":"Bodyguard, Godfather, Arsonist, Crusader",
      "additional":"Bodyguards protecting themselves with their vest will not counter-attack any attacking roles that visit them that Night.\n\nThe bodyguard will also protect their target against the Vigilante. The Bodyguard and the Vigilante will both die.\n\nBodyguard can attack the Vampire Hunter if the Bodyguard was protecting a Vampire, since the Vampire Hunter will attack the Vampire.\n\nBodyguard does not protect against astral or indirect attacks, such as; Ambusher ambushes, Veteran alerts, other Bodyguard counter-attacks, Hex Master attacks, or an indieect Werewolf rampage.\n\nIf a level 3 Juggernaut attack your target, their Unstoppable Attack will ignore your protection ability and allow them to kill their target, you will however still deal a Powerful Attack to yourself and the Juggernaut.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Doctor",
      "alignment":"Town",
      "alignmentType":"Protective",
      "attack":"None",
      "defense":"None",
      "abilities":"Heal one person each Night. You will grant them Powerful Defence.\n\nOnce per game, you can instead choose to protect yourself, granting yourself Powerful Defence for one Night.",
      "attributes":"If you successfully heal your target from an attack, you and your target will learn they were attacked but healed.",
      "goal":"Lynch every criminal and evildoer.",
      "classicResults":"Doctor, Disguiser, Serial Killer",
      "covenResults":"Doctor, Disguiser, Serial Killer, Potion Master",
      "additional":"The Doctor cannot heal a revealed Mayor.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Escort",
      "alignment":"Town",
      "alignmentType":"Support",
      "attack":"None",
      "defense":"None",
      "abilities":"Choose someone to distract each Night, preventing them from using their ability (if they are not Roleblock Immune).",
      "attributes":"Target learns they were Roleblocked.\n\nRoleblocking a Serial Killer that isn't Cautious cause them to kill you along with their intended target. Roleblocking a Werewolf on a Full Moon will force them to stay at home, attacking all visitors including you.",
      "goal":"Lynch every criminal and evildoer.",
      "classicResults":"Escort, Transporter, Consort, Hypnotist",
      "covenResults":"Escort, Transporter, Consort, Hypnotist",
      "additional":"Escort has Roleblock Immunity.\n\nYou do not learn if your target was Roleblock Immune.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Mayor",
      "alignment":"Town",
      "alignmentType":"Support",
      "attack":"None",
      "defense":"None",
      "abilities":"Choose to reveal yourself as the Mayor at any point during the day. This is done using the pop-up menu during any of the day phases. This will reveal your role to everyone.\n\nIf you are unable to use the pop-up menu, you can also reveal by saying 'I reveal as Mayor' to the Host, but say it exactly. You can still reveal even if you are Blackmailed by a Blackmailer.",
      "attributes":"Once revealed, your vote counts as three during accusations and voting phases. However, when revealed, you can no longer be healed by a Doctor and you are no longer able to use whispers.",
      "goal":"Lynch every criminal and evildoer.",
      "classicResults":"Investigator, Consigliere, Mayor",
      "covenResults":"Investigator, Consigliere, Mayor, Tracker, Plaguebearer",
      "additional":"Mayor has no Roleblock Immunity, but their ability cannot be blocked as it's a Day Ability.\n\nBe careful. In the rare event you get converted to a Vampire as a Revealed Mayor, you will no longer appear as a Mayor, lose your votes and people will be able to whisper you. This will give away you are no longer a Mayor.\n\nAs the Mayor, you are able to win a one-verse-one with any roles during the accusation phase, since you can break the voting tie.",
      "dlc":false,
      "unique":true,
      "community":false,
      "color":null
   },
   {
      "name":"Medium",
      "alignment":"Town",
      "alignmentType":"Support",
      "attack":"None",
      "defense":"None",
      "abilities":"You can speak with the dead at Night. The host has to summon you out of your house and send you to the graveyard to talk with the dead.\n\nYour ability works even if you are jailed.",
      "attributes":"Once per game, while you are dead, you can seance a living player to speak with them privately at Night.",
      "goal":"Lynch every criminal and evildoer.",
      "classicResults":"Medium, Janitor, Retributionist",
      "covenResults":"Medium, Janitor, Retributionist, Necromancer, Trapper",
      "additional":"Medium has no Roleblock Immunity, but their ability cannot be blocked as it is a passive Night ability. However if the Medium is jailed they are not allowed to speak while with the dead, since they are being questioned by the Jailor.\n\nThe host can handle the Medium's ability in different ways depending on preference. They can either summon you before starting the faction meetings or after the faction meetings have ended, you can talk with the dead in the graveyard until morning. Be sure to not leave the graveyard where you might be seen or see what you shouldn't, instead respawn and teleport to your house.\n\nInformation you learn from the dead can be used in your last will, and information you tell players during a Seance can be used in their last will.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Retributionist",
      "alignment":"Town",
      "alignmentType":"Support",
      "attack":"None",
      "defense":"None",
      "abilities":"At night, raise a dead player as a zombie and have them use their ability on your behalf. Each dead player can only be used once. Only revealed Town roles can be used, with a few exceptions.",
      "attributes":"The Retributionist only use Town roles, only those that are not Cleaned or Stoned, and cannot use the Psychic, Jailor, Veteran, Trapper, Mayor, Medium or Transporter.\n\nDead players can only be used once. If the target has been reanimated by a Necromancer, they learn their ability has failed and the target will no longer be eligible for resurrection. If the Retributionist and Necromancer target the same player, the Necromancer has priority.",
      "goal":"Lynch every criminal and evildoer.",
      "classicResults":"Medium, Janitor, Retributionist",
      "covenResults":"Medium, Janitor, Retributionist, Necromancer, Trapper",
      "additional":"Retributionist has Roleblock and Control Immunity.\n\nImportant: Community roles may have their own restrictions. Check the additional information for individual Community roles to see where restrictions apply.\n\nIf the rare circumstance that an Amnesiac uses a Retributionist, they cannot use any targets used by the previous Retributionist.\n\nA Tracker will see you visit the house of the dead player you want to use. And a Lookout will see the dead player you used visit your second target.",
      "dlc":false,
      "unique":true,
      "community":false,
      "color":null
   },
   {
      "name":"Transporter",
      "alignment":"Town",
      "alignmentType":"Support",
      "attack":"None",
      "defense":"None",
      "abilities":"Choose two people to switch places with each other for the Night. This will swap all targeted actions against them at Night (check additional information for examples).",
      "attributes":"You visit both targets.\n\nTargets will learn they have been transported, but not with who. You can choose to transport yourself with your second target.\n\nIf a target is Jailed, the transport will fail and you will learn that one of your targets was jailed.",
      "goal":"Lynch every criminal and evildoer.",
      "classicResults":"Escort, Transporter, Consort, Hypnotist",
      "covenResults":"Escort, Transporter, Consort, Hypnotist",
      "additional":"The Transporter has Roleblock and Control Immunity.\n\nYou cannot swap with an empty house, only alive players.\n\nThe Transporter will change all targeted actions against two players. Example:\nThe Investigator is going to investigate House 1. The Transporter swaps House 1 and 2. The Investigator will instead investigate House 2, but they will be unaware of this.\n\nIf multiple Transporters target the same houses, a random Transporter takes priority over which house performs the first swap. Process the second swap with the swapped houses.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Psychic",
      "alignment":"Town",
      "alignmentType":"Investigative",
      "attack":"None",
      "defense":"None",
      "abilities":"Receive three house numbers every odd Night, at least one of which will be evil.\nReceive two house numbers every even Night, at least one of which will be good.",
      "attributes":"Check additional information to see what roles count as good or evil roles.",
      "goal":"Lynch every criminal and evildoer.",
      "classicResults":"N/A",
      "covenResults":"Survivor, Vampire Hunter, Amnesiac, Medusa, Psychic",
      "additional":"Good: All Town and Neutral Benign.\nEvil: Mafia, Coven, Neutral Killing, Neutral Chaos and Neutral Evil.\n\nCommunity roles with custom alignments may appear differently, check individual roles for more information.\n\nIf you are Jailed or Roleblocked, you will not receive any information that night.\n\nIf there are less than 3 players on an odd night, or no other good players on an even night, the Psychic will simply learn they could not get a vision that night.\n\nThe house numbers given to the Psychic are always one confirmed good or evil and the others are totally random. This means that on an odd night you could get house numbers of one evil and two good, two evil and one good, or even three evils. The Psychic will never get their own house number.",
      "dlc":true,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Tracker",
      "alignment":"Town",
      "alignmentType":"Investigative",
      "attack":"None",
      "defense":"None",
      "abilities":"Track someone at Night to see who they visit.\n\nIf the target does not visit anyone, their ability is Astral or uses an ability on themselves, you are simply told they visited no one.",
      "attributes":"",
      "goal":"Lynch every criminal and evildoer.",
      "classicResults":"N/A",
      "covenResults":"Investigator, Consigliere, Mayor, Tracker, Plaguebearer",
      "additional":"Using your ability on an Retributionist or Necromancer will show them visiting a dead player's house if they did anything that night.\n\nIf you track a Jailor, you will see them not visiting anyone. Jailor does not leave their house, even if they choose to jail or execute someone.\n\nIf you track a Transporter or Disguiser, you will see them visiting both their targets.",
      "dlc":true,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Crusader",
      "alignment":"Town",
      "alignmentType":"Protective",
      "attack":"Basic",
      "defense":"None",
      "abilities":"Guard someone each Night, granting them Powerful Defence.",
      "attributes":"Careful, you will deal a Basic attack to one visitor at random, regardless of their role.",
      "goal":"Lynch every criminal and evildoer.",
      "classicResults":"N/A",
      "covenResults":"Bodyguard, Godfather, Arsonist, Crusader",
      "additional":"Vampire visitors can't be attacked, but their bite will be blocked by the defense.\n\nCrusader cannot attack an astral visitor, such as Hex Master with the Necronomicon.\n\nIf a Necromancer or Retributionist reanimate a dead house to visit the Crusader's target, the reanimated corpse is among the visitors that can be randomly attacked causing the attack to be wasted.",
      "dlc":true,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Trapper",
      "alignment":"Town",
      "alignmentType":"Protective",
      "attack":"Powerful",
      "defense":"None",
      "abilities":"If you have an available trap, choose a player to place a trap at their house.\n\nIf you have no available trap, you will build a trap. Traps take one Night to build; they are built automatically at the end of the Night.\n\nIf you have a trap placed, you can choose to remove it. The trap will not need to be rebuilt and will be ready for placement the next Night. If a trap is triggered instead, it will need to be rebuilt.",
      "attributes":"The Trap will trigger when the trapped house is visited, you will learn the roles of all players that visited the trapped house that night (but not who). If the trapped house was attacked, the Trap will also protect the house owner with Powerful Defence from one attack and deal a Powerful Attack to the associated attacker.",
      "goal":"Lynch every criminal and evildoer.",
      "classicResults":"N/A",
      "covenResults":"Medium, Janitor, Retributionist, Necromancer, Trapper",
      "additional":"If the Trapper is controlled on a night where they have an available trap, they will place it at the house they were controlled to and not know where it is. If the trap is triggered on a night the Trapper is controlled, the controller will get the information from it.\n\nIf the Trapper dies, the trap remains at the house's target until triggered. If the Trapper is converted to a Vampire, the trap is removed.\n\nTrapper starts the game with no available trap.",
      "dlc":true,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Godfather",
      "alignment":"Mafia",
      "alignmentType":"Killing",
      "attack":"Basic",
      "defense":"Basic",
      "abilities":"Choose who to attack at Night. If a Mafioso is alive, they will attack the target for you. If the Mafioso is Roleblocked or Jailed, or there is no Mafioso, you will carry out the attack yourself.",
      "attributes":"You have Basic Defence and will appear not supsicious to a Sheriff.",
      "goal":"Kill anyone that will not submit to the Mafia.",
      "classicResults":"Bodyguard, Godfather, Arsonist",
      "covenResults":"Bodyguard, Godfather, Arsonist, Crusader",
      "additional":"",
      "dlc":false,
      "unique":true,
      "community":false,
      "color":null
   },
   {
      "name":"Mafioso",
      "alignment":"Mafia",
      "alignmentType":"Killing",
      "attack":"Basic",
      "defense":"None",
      "abilities":"Choose a target to attack at Night. If there is a Godfather, anyone they pick overrides your decision. If the Godfather is Roleblocked or Jailed, you will attack your own target instead.",
      "attributes":"If you start the game as Mafioso and there is a Godfather, you become Godfather when they are killed.",
      "goal":"Kill anyone that will not submit to the Mafia.",
      "classicResults":"Vigilante, Veteran, Mafioso, Ambusher",
      "covenResults":"Vigilante, Veteran, Mafioso, Pirate, Ambusher",
      "additional":"If a Mafioso is controlled by a Witch but there is a Godfather ordering the Mafioso to kill their target, the Mafioso will still attack the Godfather's target.\n\nIn the extremely rare event that an Amnesiac remembers themselves as the Godfather and dies, a Promoted Mafioso can be promoted to Godfather.",
      "dlc":false,
      "unique":true,
      "community":false,
      "color":null
   },
   {
      "name":"Ambusher",
      "alignment":"Mafia",
      "alignmentType":"Killing",
      "attack":"Basic",
      "defense":"None",
      "abilities":"Choose one person to lie in wait outside their house each Night. You will deal a Basic Attack to one random non-Mafia visitor.",
      "attributes":"If you ambush a visitor, all visitors will learn they saw your house number lying in ambush at the target.",
      "goal":"Kill anyone that will not submit to the Mafia.",
      "classicResults":"Vigilante, Veteran, Mafioso, Ambusher",
      "covenResults":"Vigilante, Veteran, Mafioso, Pirate, Ambusher",
      "additional":"Your attacks are considered Indirect, meaning they don't trigger Traps or Bodyguard counterattacks, and donâ€™t show up to the Spy.\n\nYou cannot select another Mafia member to lie in wait at their house.\n\nYou can still attack a town traitor if they visit your target.\n\nAt the start of a night, if there is no Godfather and no Mafioso, a random mafia member is promoted to Mafioso.",
      "dlc":false,
      "unique":true,
      "community":false,
      "color":null
   },
   {
      "name":"Blackmailer",
      "alignment":"Mafia",
      "alignmentType":"Support",
      "attack":"None",
      "defense":"None",
      "abilities":"Choose one person each Night to blackmail. Blackmailed players are not allowed to speak or whisper the following day.",
      "attributes":"If the Blackmailed player speaks, enters a whisper or performs gestures to communicate, they will be immediately killed on the spot for breaking the rules (blackmail is meant to be forced). On trial, Blackmailed players can only say 'I am blackmailed.' once and nothing else. Last words are unaffected by Blackmail.",
      "goal":"Kill anyone that will not submit to the Mafia.",
      "classicResults":"Spy, Blackmailer, Jailor",
      "covenResults":"Spy, Blackmailer, Jailor, Guardian Angel",
      "additional":"Unlike the Blackmailer in the original game, you are not allowed to hear whispers. This is due to game limitations in VRChat that makes it impossible for you to eavesdrop on whispers.\n\nAn unrevealed Mayor who has been Blackmailed can still reveal themselves as Mayor during the day.\n\nAt the start of a night, if there is no Godfather and no Mafioso, a random mafia member is promoted to Mafioso.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Consigliere",
      "alignment":"Mafia",
      "alignmentType":"Support",
      "attack":"None",
      "defense":"None",
      "abilities":"Investigate someone each Night to learn their exact role.",
      "attributes":"Anyone that was Doused or Hexed will come up as the Arsonist or Hex Master respectively. You will not be fooled by Frames or your Disguiser's disguises.\n\nA Consigliere investigating a Framed player will not remove that player's Frame.",
      "goal":"Kill anyone that will not submit to the Mafia.",
      "classicResults":"Investigator, Consigliere, Mayor",
      "covenResults":"Investigator, Consigliere, Mayor, Tracker, Plaguebearer",
      "additional":"At the start of a night, if there is no Godfather and no Mafioso, a random mafia member is promoted to Mafioso.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Consort",
      "alignment":"Mafia",
      "alignmentType":"Support",
      "attack":"None",
      "defense":"None",
      "abilities":"Choose someone to distract each Night, preventing them from using their ability (if they are not Roleblock Immune).",
      "attributes":"Target learns they were Roleblocked.\n\nRoleblocking a Serial Killer that isn't Cautious cause them to kill you along with their intended target. Roleblocking a Werewolf on a Full Moon will force them to stay at home, attacking all visitors including you.",
      "goal":"Kill anyone that will not submit to the Mafia.",
      "classicResults":"Escort, Transporter, Consort, Hypnotist",
      "covenResults":"Escort, Transporter, Consort, Hypnotist",
      "additional":"Consort has Roleblock Immunity.\n\nYou do not learn if your target was Roleblock Immune.\n\nAt the start of a night, if there is no Godfather and no Mafioso, a random mafia member is promoted to Mafioso.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Disguiser",
      "alignment":"Mafia",
      "alignmentType":"Deception",
      "attack":"None",
      "defense":"None",
      "abilities":"Choose to either disguise yourself as the role of your second target, or disguise one of the other Mafia members as second target. Neither you nor your disguised teammates learns the role of your second target.",
      "attributes":"If a Sheriff or Investigator checks a disguised player, they will see the results of the player they were disguised as.\n\nA Lookout watching a target visited by a disguised player, will see it as if the player they were disguised as visited the target instead.",
      "goal":"Kill anyone that will not submit to the Mafia.",
      "classicResults":"Doctor, Disguiser, Serial Killer",
      "covenResults":"Doctor, Disguiser, Serial Killer, Potion Master",
      "additional":"You visit both your targets.\n\nYour disguises can fool Spies. If you disguise yourself, Spies won't learn of your visit. If you disguise a fellow Mafia member, Spies will learn of a visit to your Mafia teammate and your second target, but the Spies won't learn of your teammate's target.\n\nAt the start of a night, if there is no Godfather and no Mafioso, a random mafia member is promoted to Mafioso.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Forger",
      "alignment":"Mafia",
      "alignmentType":"Deception",
      "attack":"None",
      "defense":"None",
      "abilities":"Choose a person to forge, rewriting their Last Will and role at Night.",
      "attributes":"You have 2 forgeries. If your target dies that Night, your forgery will replace their Last Will and their role.",
      "goal":"Kill anyone that will not submit to the Mafia.",
      "classicResults":"Lookout, Forger, Witch",
      "covenResults":"Lookout, Forger, Juggernaut, Coven Leader",
      "additional":"If your target does not die, your forgery is wasted. Your forgery will take place effect if they die, even if they were not killed by the Mafia (unless they were Jailed and executed or Cleaned/Stoned).\n\nIf the target is Forged and Cleaned or Stoned, the Clean/Stone will take priority.\n\nIn the incredibly rare event that you were Controlled into forging a target that died but did not plan to forge anyone, the forged target will have their will removed and they will appear as the Forger.\n\nAt the start of a night, if there is no Godfather and no Mafioso, a random mafia member is promoted to Mafioso.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Framer",
      "alignment":"Mafia",
      "alignmentType":"Deception",
      "attack":"None",
      "defense":"None",
      "abilities":"Choose one person to Frame each Night.",
      "attributes":"Sheriffs will see a Framed target as Suspicious and an Investigator will receive the results of a Framer. They remain Framed until they are investigated.",
      "goal":"Kill anyone that will not submit to the Mafia.",
      "classicResults":"Framer, Vampire, Jester",
      "covenResults":"Framer, Vampire, Jester, Hex Master",
      "additional":"At the start of a night, if there is no Godfather and no Mafioso, a random mafia member is promoted to Mafioso.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Hypnotist",
      "alignment":"Mafia",
      "alignmentType":"Deception",
      "attack":"None",
      "defense":"None",
      "abilities":"Choose a target to give them false information. Check Additional Information for possible messages. ",
      "attributes":"The target is unaffected by the false messages you give them; if you give a false \"You were Roleblocked!\" message they will still receive their normal messages too. Spies who bug your target will receive the same false information.\n\nAt the start of a night, if there is no Godfather and no Mafioso, a random mafia member is promoted to Mafioso.",
      "goal":"Kill anyone that will not submit to the Mafia.",
      "classicResults":"Escort, Transporter, Consort, Hypnotist",
      "covenResults":"Escort, Transporter, Consort, Hypnotist",
      "additional":"Coven messages are only allowed in Coven games. Classic messages can be used in Coven games.\n\nClassic:\nYou were transported to another location!\nYou were roleblocked!\nYou were attacked but someone fought your attacker!\nYou were attacked but healed!\nYou were controlled by a Witch!\n\nCoven:\nYou were poisoned. You will die tomorrow!\nYou were attacked but protected!\nSomeone tried to poison you, but you someone fought your attacker!\nYou triggered a trap!\nYou were attacked but a trap saved you!\nA trap attacked you but you were healed!",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Janitor",
      "alignment":"Mafia",
      "alignmentType":"Deception",
      "attack":"None",
      "defense":"None",
      "abilities":"Choose a person to clean, hiding their role and Last Will if they die that Night.",
      "attributes":"You have 3 cleans. If your target dies that Night, your clean will hide their Last Will and their role. You will also learn their role upon successfully cleaning them.",
      "goal":"Kill anyone that will not submit to the Mafia.",
      "classicResults":"Medium, Janitor, Retributionist",
      "covenResults":"Medium, Janitor, Retributionist, Necromancer, Trapper",
      "additional":"If your target does not die, your clean is wasted. Your clean will take effect if they die, even if they were not killed by the Mafia (unless they were Jailed and executed or Stoned).\n\nIf the target is Forged or Stoned, your Clean will take priority.\n\nAt the start of a night, if there is no Godfather and no Mafioso, a random mafia member is promoted to Mafioso.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Coven Leader",
      "alignment":"Coven",
      "alignmentType":"Evil",
      "attack":"None",
      "defense":"None",
      "abilities":"You may choose to control a player each Night. If they are able to visit other players, you will make them visit and use their ability on another player.\n\nYou will receive all feedback your target would have otherwise received. Your target will not receive their feedback. Such as investigative ability results or attack result messages.",
      "attributes":"With the Necronomicon, you will gain Basic Defence and you will now also deal a Basic Attack to player you control.\n\nYour target will learn they were controlled. You learn the role of the player you control, even if they are control immune. You learn if your target was control immune.\n\nThe Coven Leader has priority when it comes to who gets the Necronomicon.",
      "goal":"Kill all who would oppose the Coven.",
      "classicResults":"N/A",
      "covenResults":"Lookout, Forger, Juggernaut, Coven Leader",
      "additional":"Coven Leader has Roleblock Immunity.\n\nIf the first target is Jailed, the control will fail.\n\nIf the Coven Leader is transported with their first target and ends up controlling themselves, they will simply visit their second target with no effect.\n\nCoven Leaders are not required to be in a Coven game.",
      "dlc":true,
      "unique":true,
      "community":false,
      "color":null
   },
   {
      "name":"Hex Master",
      "alignment":"Coven",
      "alignmentType":"Evil",
      "attack":"Unstoppable",
      "defense":"None",
      "abilities":"You may choose to Hex a player each Night.\n\nIf the night ends with every non-Coven member Hexed, the Final Hex automatically happens and deals an Unstoppable Attack to everyone that is Hexed.",
      "attributes":"Hexed players will appear as suspicious to the Sheriff. They will also show up under the Hex Master's results to an Investigator and Consigliere.\n\nWith the Necronomicon, your Hex ability also deal a Basic Attack and is Astral.",
      "goal":"Kill all who would oppose the Coven.",
      "classicResults":"N/A",
      "covenResults":"Framer, Vampire, Jester, Hex Master",
      "additional":"The Final Hex happens even if the Hex Master is roleblocked or die on the night it happens.\n\nIn the rare event a Hex Master tries to Hex another Coven member, that member will become Hexed. They will die to the Final Hex.",
      "dlc":true,
      "unique":true,
      "community":false,
      "color":null
   },
   {
      "name":"Medusa",
      "alignment":"Coven",
      "alignmentType":"Evil",
      "attack":"Powerful",
      "defense":"None",
      "abilities":"You may choose to Stone Gaze at Night, turning everyone who visits you to stone, erasing their role and Last Will.\n\nIf you have the Necronomicon, you can visit other players, turning only your target to Stone.",
      "attributes":"Medusa can be roleblocked to prevent Stone Gaze. You can only Stone Gaze at home 3 times per game. If you have the Necronomicon, you can visit other players infinitely.\n\nMedusa only gets the Necronomicon if they are the last Coven member alive.",
      "goal":"Kill all who would oppose the Coven.",
      "classicResults":"N/A",
      "covenResults":"Survivor, Vampire Hunter, Amnesiac, Medusa, Psychic",
      "additional":"Unlike the Veteran, the Medusa does not gain Basic Defence when Gazing.\n\nIf the target is also cleaned by a Janitor, the Clean will take priority.",
      "dlc":true,
      "unique":true,
      "community":false,
      "color":null
   },
   {
      "name":"Necromancer",
      "alignment":"Coven",
      "alignmentType":"Evil",
      "attack":"None",
      "defense":"None",
      "abilities":"At night, raise a dead player as a zombie and have them use their ability on your behalf. You have priority over the Retributionist. Check additional information for a full list of ineligible roles.\n\nWith the Necronomicon, you may perform an Astral Basic Attack instead.",
      "attributes":"Once a dead player has been used by the Necromancer or the Retributionist, it can no longer be used.\n\nA Tracker will see you visit the house of the dead player you want to use. And a Lookout will see the dead player you used visit your second target.",
      "goal":"Kill all who would oppose the Coven.",
      "classicResults":"N/A",
      "covenResults":"Medium, Janitor, Retributionist, Necromancer, Trapper",
      "additional":"Necromancer has Roleblock and Control Immunity.\n\nNecromancer cannot use these roles:\nTown Support (except Escort)\nExecutioner or Jester\nJailor\nVeteran\nTrapper\nSurvivor\nAmnesiac\nPirate\nCoven Leader\nMedusa\nPotion Master\n\nSince the Pestilence will also rampage at their own house and you will visit them when using their role, you will also be attacked by the Pestilence.\n\nImportant: Community roles may have their own restrictions. Check the additional information for individual Community roles to see where restrictions apply.",
      "dlc":true,
      "unique":true,
      "community":false,
      "color":null
   },
   {
      "name":"Poisoner",
      "alignment":"Coven",
      "alignmentType":"Evil",
      "attack":"Basic",
      "defense":"None",
      "abilities":"You may choose to Poison a player each Night. Poison may only be cured by a Doctor, Potion Master or Guardian Angel.\n\nIf your target has no defence, the target will be poisoned and will die the next day.",
      "attributes":"Players learn if they are poisoned. If your poisoned target gains any form of defence the next Night (such as self-vesting or Jail), the target will still die to Poison unless they were healed.\n\nWith the Necronomicon, Doctors and the Potion Master can no longer cure Poison. Players will learn that their Poison cannot be healed. Guardian Angel can still remove Poison.",
      "goal":"Kill all who would oppose the Coven.",
      "classicResults":"N/A",
      "covenResults":"Sheriff, Executioner, Werewolf, Poisoner",
      "additional":"Poisoning is considered an attack and you will be attacked by traps and Bodyguards.",
      "dlc":true,
      "unique":true,
      "community":false,
      "color":null
   },
   {
      "name":"Potion Master",
      "alignment":"Coven",
      "alignmentType":"Evil",
      "attack":"Basic",
      "defense":"None",
      "abilities":"You may use one of three potions:\nHealing potions give your target Powerful Defence and cures poison.\nRevealing potions reveal your target's role to you.\nAttacking potions deal a basic attack to your target.\n",
      "attributes":"Each potion has a 3 day cooldown. With the Necronomicon, your potions no longer have cooldowns.\n\nHealing potions cannot be used on yourself but you can use it on other members of the Coven.\nRevealing potions are not fooled by Frames, Douses or Hexes.",
      "goal":"Kill all who would oppose the Coven.",
      "classicResults":"N/A",
      "covenResults":"Doctor, Disguiser, Serial Killer, Potion Master",
      "additional":"Potion Master has Control immunity.",
      "dlc":true,
      "unique":true,
      "community":false,
      "color":null
   },
   {
      "name":"Amnesiac",
      "alignment":"Neutral",
      "alignmentType":"Benign",
      "attack":"None",
      "defense":"None",
      "abilities":"Choose a dead player at Night to become that role at the start of the next Day if you survive. This ability is Astral.\n\nYou cannot select anyone Cleaned by a janitor or Stoned by a Medusa.",
      "attributes":"Once an Amnesiac remembers what their role is, it is announced to the whole Town that 'An Amnesiac has remembered themselves as [Role]', but not who that Amnesiac is.\n\nIf an Amnesiac tries to remember someone who was Forged, they will become that person's real role instead.",
      "goal":"Remember who you are and complete that role's goal.",
      "classicResults":"Survivor, Vampire Hunter, Amnesiac",
      "covenResults":"Survivor, Vampire Hunter, Amnesiac, Medusa, Psychic",
      "additional":"If multiple Amnesiacs attempt to remember themselves as the same unique role, a random Amnesiac will succeed and the others will fail.\n\nIf an Amnesiac tries to remember themselves as a unique role that already exist among living players, for example Godfather or Mafioso, the ability will fail.\n\nIf you are roleblocked or controlled, you will be unable to remember a role. However, being controlled into yourself announces to the Town that an Amnesiac has remembered being an Amnesiac.\n\nYou will not become your chosen role if you die the same Night you try to remember yourself as a role.\n\nIf the game ends before you remember a role, you will lose.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":"#44A6C6"
   },
   {
      "name":"Survivor",
      "alignment":"Neutral",
      "alignmentType":"Benign",
      "attack":"None",
      "defense":"None",
      "abilities":"You can choose to put on a bulletproof vest at Night, protecting yourself from Basic Attacks.",
      "attributes":"You have 4 vests. You win with anyone, simply make it to the end of the game to win.",
      "goal":"Survive until the end of the game.",
      "classicResults":"Survivor, Vampire Hunter, Amnesiac",
      "covenResults":"Survivor, Vampire Hunter, Amnesiac, Medusa, Psychic",
      "additional":"Survivor does not have Control Immunity, but the Witch cannot control whether or not they use their ability. Even if they are controlled, the Survivor can choose to equip the vest.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":"#C8C800"
   },
   {
      "name":"Executioner",
      "alignment":"Neutral",
      "alignmentType":"Evil",
      "attack":"None",
      "defense":"Basic",
      "abilities":"You have no ability. Instead you must trick the town into lynching your assigned target.",
      "attributes":"Your target is randomly assigned at the start of the game. Your target is always a Town, but cannot be Mayor or Jailor.\n\nIf your target is killed at Night, you will become a Jester.",
      "goal":"Get your assigned target lynched at any cost.",
      "classicResults":"Sheriff, Executioner, Werewolf",
      "covenResults":"Sheriff, Executioner, Werewolf, Poisoner",
      "additional":"It is not announced that the Executioner has won or lost until the end of the game.\n\nYour target has to be lynched while you are alive. If you die after your target was successfully lynched you will still win at the end of the game.\n\nThe game will end when there are no more evil roles able to kill the Town or the evil roles have no one to oppose them, even if your target is still alive.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Jester",
      "alignment":"Neutral",
      "alignmentType":"Evil",
      "attack":"None",
      "defense":"None",
      "abilities":"You have no ability. Instead you must trick the Town into voting against you.",
      "attributes":"Haunt one player who voted Guilty or Abstain when you are lynched, dealing an Unstoppable Attack to them.\n\nPestilence is immune to haunts as have Invincible Defence.",
      "goal":"Get yourself lynched by any means necessary.",
      "classicResults":"Framer, Vampire, Jester",
      "covenResults":"Framer, Vampire, Jester, Hex Master",
      "additional":"If you Haunt the Pestilence, they will not die as the Haunt is considered an Unstoppable Attack while the Pestilence have Invincible Defence. The Jester will not be able to Haunt any other players if they do so.\n\nYour haunt is not affected by Transporters. You will always Attack your chosen target.\n\nIf you survive until the end of the game, you lose. The game will end when there are no more evil roles able to kill the Town or the evil roles have no one to oppose them.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":"#F49FD0"
   },
   {
      "name":"Witch",
      "alignment":"Neutral",
      "alignmentType":"Evil",
      "attack":"None",
      "defense":"None",
      "abilities":"You may choose to control a player each Night. If they are able to visit other players, you will make them visit and use their ability on another player.\n\nYou will receive all feedback your target would have otherwise received. Your target will not receive their feedback. Such as investigative ability results or attack result messages.",
      "attributes":"You have Basic Defence against only one attack. Your defence will be removed afterwards, unless you were protected or healed.\n\nYour target will learn they were controlled. You learn the role of the player you control, even if they are control immune. You learn if your target was control immune.",
      "goal":"Survive to see the Town lose the game.",
      "classicResults":"Lookout, Forger, Witch",
      "covenResults":"N/A",
      "additional":"Witch has Roleblock Immunity.\n\nIf the first target is Jailed, the control will fail.\n\nIf more than one Witch wants to control the same target, a random Witch will be able to control the target and the others will fail.\n\nIf the Witch is controlled by another Witch, then the first target of the controlled Witch will be replaced with the second target of the controlling Witch. If the Witch ends up controlling themselves, they will simply visit their second target with no effect.\n\nIf there are no more evil players able to kill, the game ends and the Witch loses, unless there are Vigilantes still able to kill or there are multiple Witches.\n\nThe Witch is not available in Coven DLC games.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":"#BF5FFF"
   },
   {
      "name":"Vampire",
      "alignment":"Neutral",
      "alignmentType":"Chaos",
      "attack":"Basic",
      "defense":"None",
      "abilities":"Vote on who the vampires should attempt to bite at night.\n\nIf there are less than 4 vampires, the target has no defense and they can be converted, the bite will convert the target to a vampire if they survive the night. After a successful conversation the vampires are forced to do nothing the following night.\n\nIf there are 4 or more vampires or the target cannot be converted, the bite deal a basic attack to the target.",
      "attributes":"The youngest Vampire (or random if there is none) will make the attack.\n\nOnly Town, Survivor, Amnesiac and Jester can be converted if unprotected. All other roles, including Mafia and Coven, are dealt a Basic Attack.",
      "goal":"Convert everyone who would oppose you.",
      "classicResults":"Framer, Vampire, Jester",
      "covenResults":"Framer, Vampire, Jester, Hex Master",
      "additional":"The Vampire's bite is considered an attack even if it would have resulted in a conversion. This is why any form of defense prevent conversion and will cause the target to be told they were attacked like normal. This also means that a Bodyguard or Trap will counter-attack a Vampire.\n\nA successful Vampire conversion happens at the end of the Night if the target wasn't otherwise killed. The converted player will be made aware they are now a Vampire.\n\nVampires will vote for who to bite and the target will be chosen based on chance rather than majority vote. If 2 Vampires vote for Target A and 1 Vampire votes for Target B, there is a 67% chance of biting Target A and a 33% chance of biting Target B.\n\nIf any Vampire is controlled by a Witch, the Witch will automatically control the youngest Vampire. The youngest Vampire will learn of the control and will be forced to bite the Witch's second target.\n\nIf a Vampire is controlled, or tricked by a Transporter, to visit another Vampire nothing will happen.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":null
   },
   {
      "name":"Arsonist",
      "alignment":"Neutral",
      "alignmentType":"Killing",
      "attack":"Unstoppable",
      "defense":"Basic",
      "abilities":"Choose to Douse a player in gasoline each night.\n\nOr Ignite all Doused targets, dealing an Unstoppable Attack to all of them.",
      "attributes":"You will passively douse anyone that visits you and learn their house numbers. This happens even if you are jailed or roleblocked.\n\nIf you happen to become Doused, you can choose to do no action at Night to clean the gasoline off yourself. Ignites will kill you if you are doused.\n\nDoused players will show as Arsonist results to Investigator and Consigliere.",
      "goal":"Live to see everyone burn.",
      "classicResults":"Bodyguard, Godfather, Arsonist",
      "covenResults":"Bodyguard, Godfather, Arsonist, Crusader",
      "additional":"Players Doused by Arsonists are not made aware they are Doused, unless they are an Arsonist themselves.\n\nWitches, Coven Leaders and Potion Masters will still learn the target's real role, even if they are Doused.\n\nArsonists controlled into themselves, or tricked into targeting themselves by a Transporter, will result in the Arsonist dousing themselves.\n\nContrary to its goal, Arsonists win with other Arsonists. If an Arsonist is dead but another Arsonist wins, the dead Arsonist wins with them.\n\nIf there are multiple Arsonists, they only know who they've Doused themselves. If one of the Arsonists ignite, all Doused players by all Arsonists will be attacked.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":"#EE7600"
   },
   {
      "name":"Serial Killer",
      "alignment":"Neutral",
      "alignmentType":"Killing",
      "attack":"Basic",
      "defense":"Basic",
      "abilities":"Choose to attack someone with a Basic Attack each Night.",
      "attributes":"Serial Killers can choose to go Cautious along with their normal action. If you choose not to go Cautious, you will additionally attack roleblockers that visit you. If you have been targeted by a Jailor or Pirate, and you don't go Cautious, you will kill them unless they kill you first.\nSee additional information for details.",
      "goal":"Kill everyone who would oppose you.",
      "classicResults":"Doctor, Disguiser, Serial Killer",
      "covenResults":"Doctor, Disguiser, Serial Killer, Potion Master",
      "additional":"Serial Killer has Roleblock Immunity, but only against Escort and Consort.\n\nIf a non-Cautious Serial Killer is roleblocked by an Escort or Consort, they will deal a basic attack to the Escort/Consort along with their intended target and the Escort/Consort will have their Last Will 'bloodied'.\nIf the Serial Killer is Cautious, they simply ignore the roleblocker.\n\nIf a non-Cautious Serial Killer is Jailed or Dueled by a Jailor or Pirate, but they don't kill the Serial Killer, the Serial Killer will deal a basic attack to the Jailor/Pirate and the Jailor/Pirate will have their Last Will 'bloodied'.\nIf the Serial Killer is Cautious, they simply don't attack the Jailor or Pirate.\n\nWhen a Last Will is 'bloodied' it is announced along with the cause of death, and the Last Will will not be readable.",
      "dlc":false,
      "unique":false,
      "community":false,
      "color":"#000080"
   },
   {
      "name":"Werewolf",
      "alignment":"Neutral",
      "alignmentType":"Killing",
      "attack":"Powerful",
      "defense":"Basic",
      "abilities":"Go on a rampage every Full Moon, dealing a Powerful Attack to your target and any visitors to them.\n\nIf you stay home or don't take any action on a Full Moon, you will attack all visitors to your house instead.",
      "attributes":"On a full moon, if you are roleblocked, you will be forced to stay at home and attack all visitors to your house, including the roleblocker.\n\nOn a full moon, if you are jailed and not executed, you are forced to attack the Jailor and any visitors to them.",
      "goal":"Kill everyone who would oppose you.",
      "classicResults":"Sheriff, Executioner, Werewolf",
      "covenResults":"Sheriff, Executioner, Werewolf, Poisoner",
      "additional":"Full Moon is on Night 2 and then Night 4 onwards.\n\nWerewolves appear Not Suspicious to the Sheriff on a non-Full Moon, but appear Suspicious on a Full Moon.\n\nIf the Werewolf's target is jailed by a Jailor, the Werewolf will still attack all visitors to the jailed target. The jailed player will however be safe because of the powerful defense granted by the Jailor. The Jailor themself do not visit their jailed target, so they are also safe from the Werewolf's rampage.\n\nIf the Werewolf is controlled, or tricked by a Transporter, to visit themselves they will instead stay home and attack all visitors.",
      "dlc":false,
      "unique":true,
      "community":false,
      "color":"#744A2D"
   },
   {
      "name":"Guardian Angel",
      "alignment":"Neutral",
      "alignmentType":"Benign",
      "attack":"None",
      "defense":"None",
      "abilities":"Choose to protect your assigned target, giving them Powerful Defence, protecting from Jailor's execution and purging any negative effects for the Night. Your protection is Astral.\n\nPurge removes Douse, Hex and Poison (even if the Poisoner has Necronomicon).",
      "attributes":"You are randomly assigned a target at the start of the game. Your assigned target cannot be an Executioner, Jester or another Guardian Angel.\n\nYou only have 2 protections. When you protect your assigned target, they cannot be voted up for trial the following day and it is announced they were protected.\n\nIf you die, you can still protect your target from the grave. If your target dies, you become a Survivor without vests.",
      "goal":"Keep your assigned target alive until the end of the game.",
      "classicResults":"N/A",
      "covenResults":"Spy, Blackmailer, Jailor, Guardian Angel",
      "additional":"It is possible for your target to be an Amnesiac and remember themselves as an Executioner, Jester or another Guardian Angel and you will still be required to protect them.\n\nYou can save your target from a Jailor's execution. However, the Guardian Angel cannot save their target from an attack by a Level 3 Juggernaut, a Vigilante committing suicide, a Jester haunt or the Hex Master's Final Hex.\n\nIf the Guardian Angel is controlled by a Coven Leader or Necromancer, they will be forced to use one of their protections on their target if they have any remaining.\n\nPurge does not remove the effects of a Framer's Frame, or Plaguebearer's Infection.",
      "dlc":true,
      "unique":false,
      "community":false,
      "color":"#FFFFFF"
   },
   {
      "name":"Pirate",
      "alignment":"Neutral",
      "alignmentType":"Chaos",
      "attack":"Powerful",
      "defense":"None",
      "abilities":"Choose someone during each day to duel them for the Night. This is done using the pop-up menu during any of the day phases.\n\nA Dueled player is roleblocked by you. Winning the duel will successfully plunder them and deal a Powerful Attack to your target.\n\nYou cannot target the same player twice in a row.",
      "attributes":"You will challenge them to a game of Rock, Paper, Scissors.\nYour Options: Scimitar, Rapier, Pistol\nTarget Options: Sidestep, Chainmail, Backpedal\n\nScimitar beats Sidestep, Rapier beats Chainmail, Pistol beats Backpedal.\n\nYou must win the duel to plunder them. In the event of a draw, you will lose.",
      "goal":"Successfully plunder two players.",
      "classicResults":"N/A",
      "covenResults":"Vigilante, Veteran, Mafioso, Pirate, Ambusher",
      "additional":"Pirate has Roleblock and Control Immunity.\n\nDueling players is a Day Ability. This means that duels cannot be prevented in any way, unless the target is Jailed by a Jailor.\n\nBodyguards and Traps will only attack you if the you win the duel. Serial Killers who are not Cautious will attack you if you lose the duel. Werewolves on a Full Moon will automatically attack you, regardless of if you win or lose the duel.\n\nYou still plunder your target even if they are protected from your attack.\n\nYou don't need to be alive in order to win. If you successfully plunder 2 players before you die, you will still win at the end of the game, even if you died the same Night you got your second plunder.",
      "dlc":true,
      "unique":true,
      "community":false,
      "color":"#DBAD59"
   },
   {
      "name":"Plaguebearer",
      "alignment":"Neutral",
      "alignmentType":"Chaos",
      "attack":"None",
      "defense":"Basic",
      "abilities":"Choose to infect a player with the plague each Night. Once all players are infected, you become Pestilence.\n\nYou will passively infect all visitors to you.",
      "attributes":"You become Pestilence if you survive to the end of the Night once all remaining players for that Night are infected. Pestilence's arrival is announced.\n\nInfected players visiting other houses will infect that house and all visitors to it. Anyone who visits an infected player directly will also become infected themselves. Players are not made aware that they've been infected.",
      "goal":"Infect all living players and become Pestilence.",
      "classicResults":"N/A",
      "covenResults":"Investigator, Consigliere, Mayor, Tracker, Plaguebearer",
      "additional":"In the rare event that the Plaguebearer is the last one standing, they can achieve a 'Plaguebearer' win. They are not required to become Pestilence.\n\nA player that is getting infected cannot at on the same night spread the infection to their own target and visitors. In other words, an infected player first starts being contagious the following night.\n\nPlaguebearer learns the names of all who is infected at the end of the Night.\n\nIf all players are infected at the end of a night, you become Pestilence at the very end of that night. If the last not infected players are killed during the day, you become Pestilence at the end of the day and it is announced before night start.",
      "dlc":true,
      "unique":true,
      "community":false,
      "color":"#CCFF63"
   },
   {
      "name":"Pestilence",
      "alignment":"Neutral",
      "alignmentType":"Chaos",
      "attack":"Powerful",
      "defense":"Invincible",
      "abilities":"Choose to rampage at a player's house each night. You deal a Powerful Attack to all visitors to your target and also visitors to you simultaneously.",
      "attributes":"You cannot be killed at Night by any means, including Jailor's execution or Jester's haunt.\n\nIf someone attempts to roleblock you, you will attack the roleblocker and still be able to rampage at your target's house. If you are Jailed, you are forced to rampage the Jailor.",
      "goal":"Kill everyone who would oppose you.",
      "classicResults":"N/A",
      "covenResults":"Investigator, Consigliere, Mayor, Tracker, Plaguebearer",
      "additional":"Pestilence has Roleblock and Control Immunity.\n\nUnlike the Juggernaut or Werewolf, Pestilence is able to rampage at their own house and their target's house simultaneously.",
      "dlc":true,
      "unique":true,
      "community":false,
      "color":"#8ED94E"
   },
   {
      "name":"Juggernaut",
      "alignment":"Neutral",
      "alignmentType":"Killing",
      "attack":"Powerful",
      "defense":"Basic",
      "abilities":"Attack a player and gain new abilities with every kill. Read attributes for more information.",
      "attributes":"No kills: You can only attack on Full Moon.\n1 kill: You can now attack every Night.\n2 kills: You now rampage at your target's house when attacking.\n3 kills: Unstoppable attack. You can kill Jailed targets and ignore Guardian Angel protection.",
      "goal":"Kill everyone who would oppose you.",
      "classicResults":"N/A",
      "covenResults":"Lookout, Forger, Juggernaut, Coven Leader",
      "additional":"Unlike a Werewolf, Juggernaut still deal a direct Powerful Attack even when they rampage, so if the Juggernaut is made to target themselves they will still die from their own Powerful Attack.",
      "dlc":true,
      "unique":true,
      "community":false,
      "color":"#8F4935"
   },
   {
      "name":"Custom Role",
      "alignment":"Neutral",
      "alignmentType":"Community",
      "attack":"None",
      "defense":"None",
      "abilities":"Custom Role. Ask the Host what you are and what you can do.",
      "attributes":"Custom Role. Ask the Host what you are and what you can do.",
      "goal":"Custom",
      "classicResults":"Custom",
      "covenResults":"Custom",
      "additional":"Custom Role. Ask the Host what you are and what you can do.",
      "dlc":false,
      "unique":false,
      "community":true,
      "color":"#BBBBBB"
   },
   {
      "name":"Mad Scientist",
      "alignment":"Neutral",
      "alignmentType":"Killing",
      "attack":"Unstoppable",
      "defense":"Basic",
      "abilities":"The Mad Scientist gains 1 progress each Night towards building a bomb. Upon reaching 4 progress, they detonate their bomb, dealing an Unstoppable Attack to all players.",
      "attributes":"The Mad Scientist is announced to be present at the start of the game.\n\nJailing the Mad Scientist prevents them from making progress that Night.",
      "goal":"Kill all who would oppose you.",
      "classicResults":"Bodyguard, Godfather, Arsonist, Mad Scientist",
      "covenResults":"Bodyguard, Godfather, Arsonist, Mad Scientist, Crusader",
      "additional":"Created by Flare Toga\n\nThe Mad Scientist is Roleblock and Control Immune. They are Not Suspicious to the Sheriff and are considered Evil to the Psychic. They cannot be used by the Necromancer.\n\nPestilence is immune to the bomb. Should the Mad Scientist detonate their bomb when the Pestilence is alive, the Pestilence wins automatically.\n\nThe host should not announce how far the Mad Scientist's progress is at any point, doing so would reveal to the town that the Mad Scientist has or has not been jailed.",
      "dlc":false,
      "unique":true,
      "community":true,
      "color":null
   },
   {
      "name":"Locksmith",
      "alignment":"Town",
      "alignmentType":"Support",
      "attack":"None",
      "defense":"None",
      "abilities":"Choose to set a special lock at someone's house at night, protecting the target using specific immunity depending on a lock, the lock breaks on use. n\n\\Locks: Attack immunity, control immunity, or roleblock immunity.",
      "attributes":"Locks take the first night to be built, meaning you have 0 night one but get all 3 on night two.\n\nYour target is not told a lock has been placed.\n\nAttack Immunity Lock will stop one basic attack.\n\nControl immunity lock will prevent the user from being controlled, giving the controller the message 'your target is control immune'.\n\nRoleblock immunity will grant immunity to being roleblocked, as well as letting you use your ability when dualed by a Pirate.\n\nCoven leaders control with Necronomicon, Necromancer's ghoul, Potion Masters kill potion will all activate the lock, not kill the locked player.",
      "goal":"Lynch every criminal and evildoer",
      "classicResults":"Doctor, Disguiser, Serial Killer, Locksmith",
      "covenResults":"Doctor, Disguiser, Serial Killer, Potion Master, Locksmith",
      "additional":"Created by NAVIE\n\nLocksmith is Not Suspicious to the Sheriff and are considered Good to the Psychic. They cannot be used by the Necromancer.\n\nEach lock has a 3-day cooldown.\n\nThe attack lock takes one night to place.\n\nOnce a lock is set it is removed from your available locks.\n\nThe lock is only active for two nights once placed or is removed instantly if someone attempts to use an ability on the lock that corresponds to its immunity.\n\nIf an Escort or Consort tries to roleblock a not cautious Serial Killer while the SK has a roleblock lock, they do not get killed by the Serial Killer.\n\nThe attack lock is unable to prevent poison regardless of when it was placed, along with Vampire conversions. (will prevent the 4 vamp basic attack)\n\nA Coven Leader with Necronomicon will still be able to control the target if they have an attack lock, but the basic attack fails.",
      "dlc":false,
      "unique":true,
      "community":true,
      "color":null
   },
   {
      "name":"Dragonne",
      "alignment":"Neutral",
      "alignmentType":"Killing",
      "attack":"Basic",
      "defense":"None",
      "abilities":"3 times per game, choose to protect your home, attacking all visitors. Each kill will grant you more power.\n\nAnyone you kill while staying at home will have their last will torn to shreds, making it unreadable.",
      "attributes":"1 kill - 1x basic defense\n2 kills - Powerful attack (When staying home)\n3 kills - Basic defense permanently\n4 kills - You may now visit others, dealing a basic attack as opposed to your main ability\n5 kills - Rampage attack when attacking others",
      "goal":"Kill all who oppose you",
      "classicResults":"vigilante, veteran, mafioso, ambusher, dragonne",
      "covenResults":"vigilante, veteran, mafioso, ambusher, pirate, dragonne",
      "additional":"Created by Navie\n\nDragonne is Suspicious to the Sheriff and are considered Evil to the Psychic. They cannot be used by the Necromancer.\n\nYou will learn how many visitors you have attacked.\n\nIf controlled by a Witch/CL and you arenâ€™t a high enough attack level to kill others, you will simply stay home and do nothing. (You will not visit)",
      "dlc":false,
      "unique":true,
      "community":true,
      "color":null
   },
   {
      "name":"Detective",
      "alignment":"Town",
      "alignmentType":"Investigative",
      "attack":"None",
      "defense":"None",
      "abilities":"Pick a dead house to Investigate and gain information depending on amount of previous investigations.",
      "attributes":"First investigation, learn if the house killer was odd or even\nSecond investigation, learn if the house killer is 1 - 8 or 9 - 15\nThird investigation, learn the house killers exact number",
      "goal":"Lynch every Criminal and Evildoer",
      "classicResults":"Sheriff, Executioner, Werewolf, Detective",
      "covenResults":"Sheriff, Executioner, Werewolf, Poisoner, Detective",
      "additional":"Created by Jordyn-\n\nDetective is Not Suspicious to the Sheriff and are considered Good to the Psychic. They cannot be used by the Necromancer.\n\nDetectives main ability is for consecutively  investigating the same dead house. Investigating a new dead house gives first investigation again\nOn each consecutive investigation you will learn if the houses killer dies that night or is dead(this information Is given at the end of the night)",
      "dlc":false,
      "unique":false,
      "community":true,
      "color":null
   },
   {
      "name":"Boxer",
      "alignment":"Town",
      "alignmentType":"Killing",
      "attack":"Powerful",
      "defense":"None",
      "abilities":"Choose a player to box with each night",
      "attributes":"Your ability has three uses.\n\nWhenever you box with a player, you deal a powerful attack to them and you take damage equal to their Attack strength. If you kill a town member, you put your boxing gloves away for the following 2 nights. \n\nIn the rare scenario that a vigilante kills you in the boxing match but gets healed that night, they will not kill themselves the following night. The same applies to a jailor who kills you but survives. They do not lose their execution ability.\n\nThis ability does not prevent other killing roles from proceeding with their target that night. That means they can kill their target and kill you, while also dying to you (if not protected).\n\nWhen your boxing target is protected by a bodyguard or crusader, then you will 'box' them instead.",
      "goal":"Lynch every criminal and evildoer",
      "classicResults":"Bodyguard, Godfather, Arsonist, Boxer",
      "covenResults":"Bodyguard, Godfather, Arsonist, Crusader, Boxer",
      "additional":"Created by TheEloGrind\n\nBoxer is Not Suspicious to the Sheriff and are considered Good to the Psychic.\n\nBoxing with a role takes its CURRENT attack strength. I.e. (Jester: none, Coven Leader: none (basic with necronomicon), Arsonist: unstoppable, Ambusher: basic, Veteran: powerful, etc.)",
      "dlc":false,
      "unique":true,
      "community":true,
      "color":null
   },
   {
      "name":"Baba Yaga",
      "alignment":"Neutral",
      "alignmentType":"Chaos",
      "attack":"Powerful",
      "defense":"Basic",
      "abilities":"Choose when to consume your visitors.",
      "attributes":"Two random visiting roles have an additional passive role â€œchildâ€. The 'children' do not know of their passive role and the Baba Yaga knows which houses are the 'children'. While using your ability, you will consume any visitors to your home, cleaning their role and will. You can only use your consumption ability two times.",
      "goal":"Consume the two children",
      "classicResults":"Medium, Janitor, Retributionist, Baba Yaga",
      "covenResults":"Medium, Janitor, Retributionist, Necromancer, Trapper, Baba Yaga.",
      "additional":"Created by TheEloGrind\n\nBaba Yaga is Not Suspicious to the Sheriff and are considered Evil to the Psychic. They cannot be used by the Necromancer.\n\nIf one of the children dies from any other means, then a new 'child' will be chosen, until there are no other visiting roles left. \n\nRoleblocked immunit and Control immunity.",
      "dlc":false,
      "unique":true,
      "community":true,
      "color":null
   },
   {
      "name":"Sniper",
      "alignment":"Mafia",
      "alignmentType":"Killing",
      "attack":"Basic",
      "defense":"None",
      "abilities":"Mafia sniper has 2 bullets he can shoot, after every shot he must reload the next night. \n\nMafia sniper can shoot the revealed Mayor during the day as long as he has at least 1 bullet by saying I assassinate the mayor' to the host. When using his day ability he will be revealed to the rest of the town. (Only possible during discussion or accusation phase)",
      "attributes":"you unable to shoot a revealed mayor at night.",
      "goal":"Kill all who will not submit to the mafia.",
      "classicResults":"Vigilante, Veteran, Mafioso, Ambusher, Sniper",
      "covenResults":"Vigilante, Veteran, Mafioso, Ambusher, Pirate, Sniper",
      "additional":"Created by ZombieBoy5221\n\nSniper is Suspicious to the Sheriff and are considered Evil to the Psychic. They cannot be used by the Necromancer.\n\nCannot be in a game with Ambusher.\n\nAt the start of a night, if there is no Godfather and no Mafioso, a random mafia member is promoted to Mafioso.",
      "dlc":false,
      "unique":true,
      "community":true,
      "color":null
   },
   {
      "name":"Beetlejuice",
      "alignment":"Neutral",
      "alignmentType":"Killing",
      "attack":"Basic",
      "defense":"Basic",
      "abilities":"Can attack every night, but gains 1 level of attack against the targeted player every time it fails against the targeted player. ",
      "attributes":"There cannot be a Juggernaut and Beetlejuice in the same game. \n\nAttacking another player will reset the attack level back to Basic. \n\nif failed an attack on a player and returns on a later day, will remember the attack level increase. \n\n(so you can attack someone on N1 and return to attack N3 and still be able to deal powerful)",
      "goal":"Be the last player standing",
      "classicResults":"N/A",
      "covenResults":"Lookout, Forger, Coven Leader, Beetlejuice",
      "additional":"Created by Ammozilla\n\nBeetlejuice is Suspicious to the Sheriff and are considered Evil to the Psychic.\n\nThere cannot be a Juggernaut and Beetlejuice in the same game.\n\nAttacking another player will reset the attack level back to Basic. \n\nif failed an attack on a player and returns on a later day, will remember the attack level increase.(so you can attack someone on N1 and return to attack N3 and still be able to deal powerful)",
      "dlc":true,
      "unique":true,
      "community":true,
      "color":null
   },
   {
      "name":"Cthulhu",
      "alignment":"Coven",
      "alignmentType":"Evil",
      "attack":"Powerful",
      "defense":"None",
      "abilities":"Cthulhu selects two targets at night. The first target is driven mad by Cthulhu and is forced to repeat the name of the second target's role throughout the day. The first target will not know the house number of the second target. The second target is unaware they were visited. Cthulhu visits both targets.",
      "attributes":"The first target must state the role name at least once during the day. The first target must not say any other words nor are they allowed to type but emoting in any other way is allowed such as spamming vote, waving, shaking their head, etc. The first target is allowed to repeat the role as much as they want but cannot say anything else. If the first target breaks any of these rules, they will be attacked every following night by an Astral powerful attack. \n\nWith the Necronomicon: Your target will always receive an Astral powerful attack the following night after being driven mad. However, it will only repeat if the target breaks the rules of the curse.",
      "goal":"Kill all who oppose the coven",
      "classicResults":"N/A",
      "covenResults":"Bodyguard, Godfather, Arsonist, Crusader, Cthulhu",
      "additional":"Created by Seal\n\nCthulhu is (Suspicious without Necronomicon, Not Suspicious with Necronomicon) to the Sheriff and are considered Evil to the Psychic. They cannot be used by the Necromancer.\n\nIf either target is in jail the ability fails. Cthulhu cannot drive Cthulhu mad through control or transport and the ability fails if the Cthulhu's first target is Cthulhu.\n\nLast to inherit Necronomicon, even after Medusa.\n\nCannot be used by Necromancer.",
      "dlc":true,
      "unique":true,
      "community":true,
      "color":null
   }
]
